[{"title": "RESP THERAPIST I", "company": "Dignity Health", "posted_date": "11/15/22", "job_reference": "9273348", "req_number": "4086", "url": "https://www.localjobs.com/job/santa-maria-ca-resp-therapist-i-4", "body": "<p>**RESP THERAPIST I**</p>\n<p>Marian Regional Medical CenterSanta Maria, California</p>\n<p>The posted compensation range of $39.27 - $48.36 /hour is a reasonable estimate that extends from the lowest to the highest pay CommonSpirit in good faith believes it might pay for this particular job, based on the circumstances at the time of posting. CommonSpirit may ultimately pay more or less than the posted range as permitted by law.</p>\n<p>**Requisition ID** 2022-274263 **Employment Type** Seasonal/Casual/OnCall/Supplemental **Department** Respiratory Therapy **Hours/Pay Period** 12 **Shift** Day **Weekly Schedule** 6:00 am - 18:30 pm **Remote** No **Category** Therapy</p>\n<p>**Overview**</p>\n<p>Marian Regional Medical Center a 191-bed facility located in Santa Maria California is recognized as one of the Top 250 Hospitals in the Nation by Healthgrades and was awarded Best Maternity Care by Newsweek. It ranks among 10% in the nation for safety core measures in cardiac services and has the only comprehensive cancer treatment and resource program from Los Angeles to San Francisco. Marian’s beautiful mission-style facility houses the latest technology to support excellent physicians and caregivers who deliver compassionate care each and every day. Marian Regional Medical Center is a part of Dignity Health’s Southwest Division and is a member of CommonSpirit Health the largest not-for-profit health care system in the nation boasting an integrated network of top quality hospitals with physicians from the most prestigious medical schools and comprehensive outpatient services - all recognized for quality safety and service. Marians offers Santa Maria Valley residents access to the most advanced technologies an expanded and enhanced Emergency Department Critical Care Unit neonatal intensive care unit and an array of womens services.</p>\n<p>**Responsibilities**</p>\n<p>**About This Position:**</p>\n<p>In keeping with Marian Medical Center health care philosophy the Respiratory Care Practitioner provides care treatment and rehabilitation to patients with pulmonary disorders by means of respiratory therapy. Respiratory Care Practitioners have knowledge of pharmacy anatomy and physiology and make judgments in consultation with a physician and other members of the health care team with regard to the respiratory care that patients receive. The patient population served by the Respiratory Care Department consists of newborn pediatric adolescent adult and the geriatricpatients requiring respiratory care services treatment or testing to maintain optimum physiological maintenance of cardiac and respiratory systems. Demonstrates proficient technical skills in the performance of respiratory therapies. Demonstrates a working knowledge of current trends in respiratory therapies; specialty technical standards equipment supplies; safety principles and practices. Demonstrates ability to communicate effectively in writing and orally. Establishes effective working relationships with other departments medical staff and co-workers. Meets MMC standard physical requirements for staff involved in direct patient care.</p>\n<p>**Qualifications**</p>\n<p>**Minimum Requirements:**</p>\n<p>+ Current California License as a Respiratory Care Practitioner</p>\n<p>+ Current CPR-AHA Certification</p>\n<p>+ Current ACLS-AHA Certification</p>\n<p>+ Current PALS-AHA Certification</p>\n<p>+ Current NRP-AHA Certification</p>\n<p>**Preferred Requirements:**</p>\n<p>+ A minimum of 1 year experience in the respiratory therapies</p>\n<p>+ Individuals with less than one-year experience will be considered on an individual basis</p>\n<p>**Equal Opportunity**</p>\n<p>CommonSpirit Health™ is an Equal Opportunity/Affirmative Action employer committed to<br />\na diverse and inclusive workforce. All qualified applicants will be considered for<br />\nemployment without regard to race, color, religion, sex, sexual orientation, gender<br />\nidentity, national origin, age, disability, marital status, parental status,<br />\nancestry, veteran status, genetic information, or any other characteristic protected<br />\nby law. For more information about your EEO rights as an applicant,<br />\npleaseclick here. (<a href=\"https://tbcdn.talentbrew.com/company/35300/img/v1\">https://tbcdn.talentbrew.com/company/35300/img/v1</a>\\_0/EEOC\\_KnowYourRightsEnglish.pdf)</p>\n<p>CommonSpirit Health™ will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information. 41 CFR 60-1.35(c).<br />\nExternal hires must pass a post-offer, pre-employment background check/drug screen. Qualified applicants with an arrest and/or conviction will be considered for employment in a manner consistent with federal and state laws, as well as applicable local ordinances, ban the box laws, including but not limited to the San Francisco and Los Angeles Fair Chance Ordinances.<br />\nIf you need a reasonable accommodation for any part of the employment process, please contact us by telephone at (415) 438-5575 and let us know the nature of your request. We will only respond to messages left that involve a request for a reasonable accommodation in the application process. We will accommodate the needs of any qualified candidate who requests a reasonable accommodation under the Americans with Disabilities Act (ADA).<br />\nCommonSpirit Health™ participates in E-Verify.</p>\n<p>Dignity Health is an Equal Opportunity/ Affirmative Action employer committed to a diverse and inclusive workforce. All qualified applicants will be considered for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, marital status, parental status, ancestry, veteran status, genetic information, or any other characteristic protected by law.</p>\n", "city": "Santa Maria", "state": "California", "country": "United States", "location": "Santa Maria, California", "function": "Healthcare", "logo": "https://www.localjobs.com/sites/default/files/company_logos/dignitylogo.jpg", "jobtype": "Full time", "education": null, "experience": null, "salary": null, "requiredlanguages": null, "requiredskills": null}, "\n\n`\n{\n    \"education\": \"Current California License as a Respiratory Care Practitioner\",\n    \"experience\": \"1 year\",\n    \"salary\": \"39.27 - 48.36 /hour\",\n    \"requiredLanguages\": null,\n    \"requiredSkills\": [\n        \"Anatomy and Physiology\",\n        \"Pharmacy\",\n        \"Respiratory Therapy\",\n        \"Safety Principles and Practices\"\n    ]\n}\n`"][{"title": "shift supervisor - Store# 49208, BOB HOPE & VARNER", "company": "Starbucks", "posted_date": "1/30/23", "job_reference": "10266914", "req_number": "4107", "url": "https://www.localjobs.com/job/cathedral-city-ca-shift-supervisor-store-49208-bob-hope-varner-0", "body": "<p>**Join us and inspire with every cup!**</p>\n<p>At Starbucks, it’s all about connection. People are at the heart of who we are, especially the people that are a part of our store team. We connect with each other, our customers and our communities to make a positive impact every day. We believe in working together to make a difference and in celebrating our shared success, which is why we call ourselves Starbucks “partners.” Starbucks is a place of warmth and belonging, where everyone is welcome, and we value the unique experiences that each partner brings to our team!</p>\n<p>As a Starbucks  **shift supervisor** , you’ll be a role model of the store operations standards that define our  _Starbucks Experience._  You’ll lead each shift, working alongside a team of baristas to deliver quality customer service and expertly-crafted products. You’ll be in an energetic store environment where you’ll have the ability to positively influence and guide others, maintain an encouraging team environment, and grow your leadership skills. We believe our shift supervisors are leaders in creating an uplifting experience for our customers and partners alike.</p>\n<p>**You’d make a great shift supervisor if you:**</p>\n<p>+ Take initiative and act as a role model to others.</p>\n<p>+ Enjoy working as a team and motivating others.</p>\n<p>+ Understand how to create a great customer service experience.</p>\n<p>+ Have a focus on quality and take pride in your work.</p>\n<p>+ Are confident in leading, deploying, and guiding others.</p>\n<p>+ Are open to learning new things (especially the latest beverage recipe!)</p>\n<p>+ Are experienced with responsibilities like cash-handling and store safety.</p>\n<p>+ Can keep cool and calm in a fast-paced, energetic work environment.</p>\n<p>+ Have excellent communications skills.</p>\n<p>From free coffee to competitive pay, Starbucks is proud to offer a comprehensive compensation and benefits package to our eligible part-time and full-time partners. Benefits include 100% tuition coverage through our  _Starbucks College Achievement Plan_ , health coverage with a variety of plans to choose from, and stock & savings programs like our equity reward program,  _Bean Stock_ . What’s more, Starbucks offers flexible scheduling and opportunities for paid time off. Visit starbucksbenefits.com for details.</p>\n<p>Benefit Information (<a href=\"https://www.starbucksbenefits.com\">https://www.starbucksbenefits.com</a>)</p>\n<p>**Summary of Experience**</p>\n<p>+ Customer service experience in a retail or restaurant environment  - 1 year</p>\n<p>**Basic Qualifications**</p>\n<p>+ Maintain regular and consistent attendance and punctuality, with or without reasonable accommodation</p>\n<p>+ Available to work flexible hours that may include early mornings, evenings, weekends, nights and/or holidays</p>\n<p>+ Meet store operating policies and standards, including providing quality beverages and food products, cash handling and store safety and security, with or without reasonable accommodations</p>\n<p>+ Six (6) months of experience in a position that required constant interacting with and fulfilling the requests of customers</p>\n<p>+ Prepare and coach the preparation of food and beverages to standard recipes or customized for customers, including recipe changes such as temperature, quantity of ingredients or substituted ingredients</p>\n<p>+ At least six (6) months of experience delegating tasks to other employees and/or coordinating the tasks of two (2) or more employees</p>\n<p>**Knowledge, Skills and Abilities**</p>\n<p>+ Ability to direct the work of others</p>\n<p>+ Ability to learn quickly</p>\n<p>+ Effective oral communication skills</p>\n<p>+ Knowledge of the retail environment</p>\n<p>+ Strong interpersonal skills</p>\n<p>+ Ability to work as part of a team</p>\n<p>+ Ability to build relationships</p>\n<p>_All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran._</p>\n<p>_We are committed to creating a diverse and welcoming workplace that includes partners with diverse backgrounds and experiences. We believe that enables us to better meet our mission and values while serving customers throughout our global communities. People of color, women, LGBTQIA+, veterans and persons with disabilities are encouraged to apply._</p>\n<p>_Qualified applicants with criminal histories will be considered for employment in a manner consistent with all federal state and local ordinances. Starbucks Corporation is committed to offering reasonable accommodations to job applicants with disabilities. If you need assistance or an accommodation due to a disability, please contact us at <a href=\"mailto:applicantaccommodation@starbucks.com\">applicantaccommodation@starbucks.com</a>._</p>\n", "city": "Cathedral City", "state": "California", "country": "United States", "location": "Cathedral City, California", "function": "Barista", "logo": "https://www.localjobs.com/sites/default/files/company_logos/starbucks-logo-200w.gif", "jobtype": "Full time", "education": null, "experience": null, "salary": null, "requiredlanguages": null, "requiredskills": null}, "\n\n```\n{\n    \"education\": null,\n    \"experience\": \"1 year customer service experience in a retail or restaurant environment\",\n    \"salary\": null,\n    \"requiredLanguages\": null,\n    \"requiredSkills\": \"Initiative, Motivation, Customer Service, Quality Focus, Leadership, Deployment, Recipe Knowledge, Cash-Handling, Store Safety, Communications\"\n}\n```"]