[{"title": "Cashier - Collins Aerospace - Melbourne", "company": "Aramark", "posted_date": "2/1/23", "job_reference": "10294998", "req_number": "2756", "url": "https://www.localjobs.com/job/melbourne-fl-cashier", "body": "<p>**Job Description**</p>\n<p>We’re looking for a “Cashier” because “Being Awesome” isn’t a job title we can use.</p>\n<p>The perfect recipe for a Cashier on our team? A bit of sugar and spice, and a pinch of everything nice! Our best Cashiers love greeting guests, solving problems, and are great at keeping track of operations. You’ll be responsible for processing transactions, balancing cash, and providing the best-of-the-best in customer service.</p>\n<p>On our team, not only will you be able to ignite your own passion, but you’ll join a team of people who love being awesome every day.</p>\n<p>**Job Responsibilities**</p>\n<p>•    Accurately operate a register/POS and handle cash and credit card transactions.</p>\n<p>•    Greet and assist customers while anticipating their needs</p>\n<p>•    Count, organize and balance cash drawer, fill out the cashier slip and make deposits</p>\n<p>•    Adheres to Aramark’s cash handling policies and procedures</p>\n<p>•    Understand and be knowledgeable of the merchandise for sale to assist customers and accurately process transactions</p>\n<p>•    Complete opening and closing procedures as assigned for unit based on operating hours</p>\n<p>•    Maintain a clean and sanitary work environment during service and at the end of shift.</p>\n<p>•    Ensure product in location is stocked to appropriate levels throughout service and replenish items as needed.</p>\n<p>•    Follow all safety policies and procedures</p>\n<p>At Aramark, developing new skills and doing what it takes to get the job done make a positive impact for our employees and for our customers. In order to meet our commitments, job duties may change or new ones may be assigned without formal notice.</p>\n<p>**Qualifications**</p>\n<p>•    Previous customer service experience preferred</p>\n<p>•    Previous cash handling experience preferred</p>\n<p>•    Basic math & counting skills required</p>\n<p>•    Must be able to work independently with limited supervision</p>\n<p>•    Complete Food Handler and Alcohol Service trainings as required by location</p>\n<p>This role may have physical demands including, but not limited to, lifting, bending, pushing, pulling and/or extended walking and standing. This role may also require uniforms and/or usage of Personal Protective Equipment (PPE).</p>\n<p>**Education**</p>\n<p>**About Aramark**</p>\n<p>**Our Mission**</p>\n<p>Rooted in service and united by our purpose, we strive to do great things for each other, our partners, our communities, and our planet.</p>\n<p>At Aramark, we believe that every employee should enjoy equal employment opportunity and be free to participate in all aspects of the company. We do not discriminate on the basis of race, color, religion, national origin, age, sex, gender, pregnancy, disability, sexual orientation, gender identity, genetic information, military status, protected veteran status or other characteristics protected by applicable law.</p>\n<p>**About Aramark**</p>\n<p>The people of Aramark proudly serve millions of guests every day through food, facilities, and uniform services in 19 countries around the world. Rooted in service and united by our purpose, we strive to do great things for each other, our partners, our communities, and our planet. We believe a career should develop your talents, fuel your passions, and empower your professional growth. So, no matter what you're pursuing - a new challenge, a sense of belonging, or just a great place to work - our focus is helping you reach your full potential. Learn more about working here at  <a href=\"http://www.aramarkcareers.com\">http://www.aramarkcareers.com</a>  or connect with us on  Facebook ,  Instagram  and  Twitter .</p>\n<p>Aramark is an EQUAL EMPLOYMENT OPPORTUNITY/AFFIRMATIVE ACTION employer – Minority/Female/Disability/Veteran</p>\n<p>Aramark will consider for employment qualified applicants with criminal histories in a manner consistent with the Los Angeles Fair Chance ordinance.</p>\n", "city": "Melbourne", "state": "Florida", "country": "United States", "location": "Melbourne, Florida", "function": "Uniform Service", "logo": "https://www.localjobs.com/sites/default/files/company_logos/aramarklogo250.gif", "jobtype": "Full time", "education": null, "experience": null, "salary": null, "requiredlanguages": null, "requiredskills": null}, "\n\n```\n{\n    \"education\": null,\n    \"experience\": \"Previous customer service & cash handling experience preferred\",\n    \"salary\": null,\n    \"requiredLanguages\": null,\n    \"requiredSkills\": \"Greeting, Problem-solving, Cash handling, Customer service, Math & counting, Working independently, Food handling, Alcohol service\"\n}\n```"][{"title": "Risk Solution Architect - Financial Services Consulting - Manager - Location Open", "company": "Ernst and Young", "posted_date": "7/19/22", "job_reference": "8018155", "req_number": "3742", "url": "https://www.localjobs.com/job/charlotte-nc-risk-solution-architect-financial-services-consulting-manager-location-open", "body": "<p>At EY, you’ll have the chance to build a career as unique as you are, with the global scale, support, inclusive culture and technology to become the best version of you. And we’re counting on your unique voice and perspective to help EY become even better, too. Join us and build an exceptional experience for yourself, and a better working world for all.</p>\n<p>**Risk Solution Architect - Financial Services Consulting - Manager**</p>\n<p>EY is the only professional services firm with a separate business unit (“FSO”) that is dedicated to the financial services marketplace. Our FSO teams have been at the forefront of every event that has reshaped and redefined the financial services industry. If you have a passion for rallying together to solve the most complex challenges in the financial services industry, come join our dynamic FSO team!</p>\n<p>You’ll get to work on cutting edge disruptive technologies and assist with building and implementing new technology solutions and products to address challenges faced by the banking industry.</p>\n<p>**The opportunity**</p>\n<p>Our Risk Solution Architecture practice helps clients modernize systems, processes, and products to enhance business and customer-facing platforms and services to support high performance in a rapidly changing, competitive environment. The team leverages Microservices, Cloud, API Management, and open-source technologies to enable end-to-end automation with safe and sound architecture at optimum cost.</p>\n<p>The Risk Solution Architecture team is changing the way our clients interact with their customers, employees, and partners alike. We are modernizing their applications, creating new ones, and driving business efficiency across their ever-changing platform and channel infrastructures. Everything we do centers around this simple story.</p>\n<p>**Your key responsibilities**</p>\n<p>You’ll be responsible for working directly with clients to transform their business capabilities into system architectures. You will manage client engagements and practice development activities inclusive of future sales opportunities, campaigns, and practice management. You will provide leadership to employees, manage, and motivate teams with diverse skills and backgrounds, consistently deliver quality client services by monitoring progress, and demonstrate in-depth technical capabilities and professional knowledge.</p>\n<p>**Skills and attributes for success**</p>\n<p>+ Ability to map target state architecture through all phases of the project lifecycle, including requirements definition, architecture design, conversion, and testing; based on a proven agile methodology.</p>\n<p>+ Demonstrate technical experience in multiple programming languages with broad knowledge in integration techniques, solution architecture and project methodologies.</p>\n<p>+ Effectively work with client engagement teams with diverse skills and backgrounds fostering an innovative and inclusive work environment.</p>\n<p>+ Demonstrate understanding of current technology environment and industry trends and provide recommendations for engagement and client service issues.</p>\n<p>+ Help recruit, develop, and retain strategy professionals, coach, and mentor team members, deliver strategy-related training, and take on other practice management tasks as needed (e.g., development of practice offerings).</p>\n<p>**To qualify for the role you must have**</p>\n<p>+ A Bachelor's degree (computer science, engineering, or related field) and approximately 5 years of related work experience in a Technology role in a financial services company OR</p>\n<p>+ A Master’s degree (computer science, engineering, or related field) and approximately 4 years of related work experience in a financial services company</p>\n<p>+ Ability to manage teams of technical advisors through all phases of the project lifecycle, including requirements definition, architecture design, conversion, and testing</p>\n<p>+ Experience with at least one programming language (Java, Scala, Python)</p>\n<p>+ Proven track record of implementing Enterprise Architecture Frameworks such as TOGAF, Zachmans and DODAF</p>\n<p>+ Implementation experience in SOA (for e.g., Service Orchestration, Service Choreography, Event Driven Architecture, Messaging middleware, etc.)</p>\n<p>+ Experience with event stream processing technologies such as Spark streaming, Storm, Akka, Kafka</p>\n<p>+ Hands on experience with at least one relational database system such as MySQL, MS SQL Server, Oracle</p>\n<p>+ Excellent written and verbal communication skills for technical writing and client presentations using tools such as PowerPoint/Excel/Word/Visio</p>\n<p>+ Ability to innovate and adapt to a rapidly changing client landscape and develop/enhance EY services to meet new demands</p>\n<p>**Ideally, you’ll also have**</p>\n<p>+ Demonstrated technology experience in one or more of the following areas:</p>\n<p>o Reconciliation & operational controls assessment and design</p>\n<p>o Risk data quality and governance</p>\n<p>o Attestation framework design and implementation</p>\n<p>o Business and functional architecture blueprint</p>\n<p>o Knowledge across multiple regulatory reports</p>\n<p>+ Experience at a financial services company or comparable experience working as a consultant in a professional services firm delivering advisory services</p>\n<p>+ Domain driven design experience, preferably focused on financial services (Banking & Capital Markets, Wealth and Asset Management, Insurance)</p>\n<p>+ Relevant industry certifications (e.g., TOGAF, AWS Cloud Certified, Pivotal Certified, CISSP, etc.)</p>\n<p>+ Experience working with Big Data technologies such as Spark, MapReduce, YARN, HDFS, Hive, Impala, Oozie, HBase, Elasticsearch, Cassandra.</p>\n<p>+ Experience with packages/vendors used in risk management including but not limited to Blue prism, Pega, WorkFusion, Oracle, Axiom, SAS, IBM/Algorithmics, Sungard, Moody’s, QRM, MarkIt, Bloomberg</p>\n<p>+ Experience with front end technologies such as: JavaScript, Node.js, Angular.js, or Backbone</p>\n<p>**What we look for**</p>\n<p>We’re seeking highly motivated managers to manage client engagement teams and lead business development activities on our strategic accounts.</p>\n<p>**What We Offer**</p>\n<p>We offer a competitive compensation package where you will be rewarded based on your performance and recognized for the value you bring to our business. In addition, our Total Rewards package includes medical and dental coverage, pension and 401(k) plans, and a wide range of paid time off options. Under our flexible vacation policy, you will decide how much vacation time you need based on your own personal circumstances. You will also be granted time off for designated EY Paid Holidays, Winter/Summer breaks, Personal/Family Care, and other leaves of absence when needed to support your physical, financial, and emotional well-being. Plus, we offer:</p>\n<p>+ Continuous learning: You will develop the mindset and skills to navigate whatever comes next.</p>\n<p>+ Success as defined by you: We will provide the tools and flexibility, so you can make a meaningful impact, your way.</p>\n<p>+ Transformative leadership: We will give you the insights, coaching and confidence to be the leader the world needs.</p>\n<p>+ Diverse and inclusive culture: We will be embraced for who you are and empowered to use your voice to help others find theirs.</p>\n<p>**About EY**</p>\n<p>As a global leader in assurance, tax, transaction and advisory services, we hire and develop the most passionate people in their field to help build a better working world. This starts with a culture that believes in giving you the training, opportunities and creative freedom to make things better. So that whenever you join, however long you stay, the exceptional EY experience lasts a lifetime.</p>\n<p>**If you can confidently demonstrate that you meet the criteria above, please contact us as soon as possible.**</p>\n<p>**Build your legacy with us.**</p>\n<p>**Apply now.**</p>\n<p>**What we offer**</p>\n<p>We offer a comprehensive compensation and benefits package where you’ll be rewarded based on your performance and recognized for the value you bring to the business.  The salary range for this job in most geographic locations in the US is $128,400 to $235,400.  The salary range for New York City Metro Area, Washington State and California (excluding Sacramento) is $154,100 to $267,500.  Individual salaries within those ranges are determined through a wide variety of factors including but not limited to education, experience, knowledge, skills and geography.  In addition, our Total Rewards package includes medical and dental coverage, pension and 401(k) plans, and a wide range of paid time off options. Under our flexible vacation policy, you’ll decide how much vacation time you need based on your own personal circumstances. You’ll also be granted time off for designated EY Paid Holidays, Winter/Summer breaks, Personal/Family Care, and other leaves of absence when needed to support your physical, financial, and emotional well-being.</p>\n<p>+  **Continuous learning:**  You’ll develop the mindset and skills to navigate whatever comes next.</p>\n<p>+  **Success as defined by you:**  We’ll provide the tools and flexibility, so you can make a meaningful impact, your way.</p>\n<p>+  **Transformative leadership:**  We’ll give you the insights, coaching and confidence to be the leader the world needs.</p>\n<p>+  **Diverse and inclusive culture:**  You’ll be embraced for who you are and empowered to use your voice to help others find theirs.</p>\n<p>+ Manager salary information:The salary range for this position in Denver is $128,400 - $214,000The salary range for this position in Las Vegas is $128,400 - $214,000The salary range for this position in Stamford is $154,100 - $256,800The salary range for this position in Hartford is $141,200 - $235,400</p>\n<p>**If you can demonstrate that you meet the criteria above, please contact us as soon as possible.**</p>\n<p>**The exceptional EY experience. It’s yours to build.**</p>\n<p>**EY | Building a better working world**</p>\n<p>EY exists to build a better working world, helping to create long-term value for clients, people and society and build trust in the capital markets.</p>\n<p>Enabled by data and technology, diverse EY teams in over 150 countries provide trust through assurance and help clients grow, transform and operate.</p>\n<p>Working across assurance, consulting, law, strategy, tax and transactions, EY teams ask better questions to find new answers for the complex issues facing our world today.</p>\n<p>EY is an equal opportunity, affirmative action employer providing equal employment opportunities to applicants and employees without regard to race, color, religion, age, sex, sexual orientation, gender identity/expression, national origin, protected veteran status, disability status, or any other legally protected basis, including arrest and conviction records, in accordance with applicable law.</p>\n<p>EY is committed to providing reasonable accommodation to individuals with disabilities. If you are a qualified individual with a disability and either need assistance applying online or need to request an accommodation during the interview process, please call 1-800-EY-HELP3, type Option 2 (HR-related inquiries) and then type Option 1 (HR Shared Services Center), which will route you to EY’s Talent Shared Services Team or email SSC Customer Support at  <a href=\"mailto:ssc.customersupport@ey.com\">ssc.customersupport@ey.com</a> .</p>\n", "city": "Charlotte", "state": "North Carolina", "country": "United States", "location": "Charlotte, North Carolina", "function": "Management/Manager", "logo": "https://www.localjobs.com/sites/default/files/company_logos/ey-logo.png", "jobtype": "Full time", "education": null, "experience": null, "salary": null, "requiredlanguages": null, "requiredskills": null}, "\n\n{\n    \"education\": \"Bachelor's degree (computer science, engineering, or related field) and approximately 5 years of related work experience OR Master's degree (computer science, engineering, or related field) and approximately 4 years of related work experience\",\n    \"experience\": \"Technology role in a financial services company\",\n    \"salary\": \"128,400 - 267,500\",\n    \"requiredLanguages\": [\"Java\",\"Scala\",\"Python\"],\n    \"requiredSkills\": [\"TOGAF\",\"AWS Cloud Certified\",\"Pivotal Certified\",\"CISSP\",\"SOA\",\"Microservices\",\"Cloud\",\"API Management\",\"open-source technologies\",\"Spark streaming\",\"Storm\",\"Akka\",\"Kafka\",\"MySQL\",\"MS SQL Server\",\"Oracle\",\"JavaScript\",\"Node.js\",\"Angular.js\",\"Backbone\",\"Reconciliation & operational controls assessment and design\",\"Risk data quality and governance\",\"Attestation framework design and implementation\",\"Business and functional architecture blueprint\",\"Knowledge across multiple regulatory reports\",\"Domain driven design\",\"Big Data technologies (Spark, MapReduce, YARN, HDFS, Hive, Impala, Oozie, HBase, Elasticsearch, Cassandra)\",\"Front end technologies (JavaScript, Node.js, Angular.js, Backbone)\"],\n}"][{"title": "Manager, Finance Operations", "company": "CDM Smith", "posted_date": "4/6/23", "job_reference": "11060601", "req_number": "3492", "url": "https://www.localjobs.com/job/el-paso-tx-manager-finance-operations", "body": "<p>**33996BR**</p>\n<p>**Requisition ID:**</p>\n<p>33996BR</p>\n<p>**Business Unit:**</p>\n<p>TSU</p>\n<p>**Job Description:**</p>\n<p>CDM Smith is one of the world’s top design, program management, and construction management firms, providing innovative and creative solutions for our clients and assisting them in achieving successful outcomes on their water, infrastructure, environmental, and transportation programs.</p>\n<p>We are seeking a leader who will manage and oversee finance and operations projects for our Technical Services Unit which is comprised of over 2,000 employees. In this position you will be responsible for conducting multiple, highly complex analyses on industry key performance indicators (KPIs) and developing recommendations for leadership. Overseeing the analyses of internal KPIs to identify past and current trends and creating reports on trends and variances. This position offers the opportunity to manage the development of financial models, and analyses to track and ensure cost control and group efficiency. Providing management oversight and operational expertise to the unit and direct reports.</p>\n<p>The position can be based out of any CDM Smith office. We offer a hybrid work environment allowing for working in the office and remotely from home.</p>\n<p>As Manager, Finance Operations you will:</p>\n<p>- Manage the development of programs to improve financial operations efficiency, consistency, and compliance in support of the Technical Services Unit's financial business objectives. Executing strategic initiatives across the unit to drive efficiency and value.</p>\n<p>- Manage the internal financial, planning, and analysis projects and initiatives for the business, including budget, forecast, and ad-hoc reporting.</p>\n<p>- Manage the development of highly complex analyses and reports providing accurate, timely, and actionable financial and/or performance improvement recommendations. This includes utilization analysis, overhead cost control and analysis, P&L analysis, backlog analysis and trending, staff workload analysis, SWOT analysis, Risk and Opportunity Analysis.</p>\n<p>- Oversee the development of consolidated findings to provide insights and recommendations into business performance, levers, and opportunities.</p>\n<p>- Support leadership decision making with in-depth analysis and assessment of business processes. Manage approvals and reporting for hardware, software, cellphones, and capital expenses.</p>\n<p>- Oversee finance operation's monitoring of the unit’s talent acquisition, and resource and performance management processes. Participate in regular discussions with recruiters to track and monitor priority hires and reports progress to unit leadership. Ensure staffing start dates are monitored and tracked as they relate to forecasting and equipment procurement.</p>\n<p>- Oversee the tracking, calculation and reporting on KPIs for SPARS staff and staff that have a role with defined goals and metrics. Review the analyses of performance metrics, including quarterly results for staff in the bonus program. Manage the group award program budget.</p>\n<p>- Assign and monitor the unit's operational primary point of contact by ensuring coordination, assistance and direction with various corporate functions and other departments or groups within the firm.</p>\n<p>- Manage the preparation of presentations to and recommendations for unit leadership. Perform ad-hoc reporting and analysis including analytical and research support for various corporate and unit projects. Recommend and develop financial content for group presentations.</p>\n<p>- Manage the day-to-day activities of staff. Lead, coach, develop and train assigned team members. Monitor staff workloads and provide team resources needed to ensure delivery of a high-quality outcome to complete their jobs. Conduct performance reviews and provide ongoing feedback of performance to direct reports. Approve time sheets, manage the group’s budget and ensures company policies are followed.</p>\n<p>- Performs other duties as required.</p>\n<p>**Job Title:**</p>\n<p>Manager, Finance Operations</p>\n<p>**Group:**</p>\n<p>HQT</p>\n<p>**Employment Type:**</p>\n<p>Regular</p>\n<p>**Minimum Qualifications:**</p>\n<p>- Bachelor’s degree.</p>\n<p>- 10 years of relevant experience with at least two years of leading teams.</p>\n<p>- Equivalent additional directly related experience will be considered in lieu of a degree.</p>\n<p>- Domestic and/or international travel may be required. The frequency of travel is contingent on specific duties, responsibilities, and the essential functions of the position, which may vary depending on workload and project demands.</p>\n<p>**Preferred Qualifications:**</p>\n<p>- Previous department reporting, financial controls, and P&L responsibility strongly preferred.</p>\n<p>- Master’s degree.</p>\n<p>- Previous experience with Oracle R12.</p>\n<p>- Previous experience with Qlik Analytics.</p>\n<p>- Proficient with MS Office Suite.</p>\n<p>- Previous experience working for a professional service organization.</p>\n<p>**EEO Statement:**</p>\n<p>We attract the best people in the industry, supporting their efforts to learn and grow. We strive to create a challenging and progressive work environment. We provide career opportunities that span a variety of disciplines and geographic locations, with projects that our employees plan, design, build and operate as diverse as the needs of our clients. CDM Smith is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, creed, sex, pregnancy and pregnancy-related conditions, sexual orientation, gender identity, national origin, age, marital status, disability, citizenship status, genetics, protected veteran status or any other characteristics protected by applicable law.</p>\n<p>**Why CDM Smith?:**</p>\n<p>Check out this video and find out why our team loves to work here! (<a href=\"https://www.cdmsmith.com/en/Video/Meet-CDM-Smith\">https://www.cdmsmith.com/en/Video/Meet-CDM-Smith</a>)</p>\n<p>**Join Us! CDM Smith – where amazing career journeys unfold.**</p>\n<p>Imagine a place committed to offering an unmatched employee experience. Where you work on projects that are meaningful to you. Where you play an active part in shaping your career journey. Where your co-workers are invested in you and your success. Where you are encouraged and supported to do your very best and given the tools and resources to do so. Where it’s a priority that the company takes good care of you and your family.</p>\n<p>Our employees are the heart of our company. As an employer of choice, our goal is to provide a challenging, progressive and inclusive work environment which fosters personal leadership, career growth and development for every employee. We value passionate individuals who challenge the norm, deliver world-class solutions and bring diverse perspectives. Join our team, and together we will make a difference and change the world.</p>\n<p>**Job Site Location:**</p>\n<p>United States - Nationwide</p>\n<p>**Agency Disclaimer:**</p>\n<p>All vendors must have a signed CDM Smith Placement Agreement from the CDM Smith Recruitment Center Manager to receive payment for your placement. Verbal or written commitments from any other member of the CDM Smith staff will not be considered binding terms. All unsolicited resumes sent to CDM Smith and any resume submitted to any employee outside of CDM Smith Recruiting Center Team (RCT) will be considered property of CDM Smith. CDM Smith will not be held liable to pay a placement fee.</p>\n<p>**Amount of Travel Required:**</p>\n<p>5%</p>\n<p>**Assignment Category:**</p>\n<p>Fulltime-Regular</p>\n<p>**Visa Sponsorship Available:**</p>\n<p>No - We will not support sponsorship, i.e. H-1B or TN Visas for this position</p>\n<p>**Skills and Abilities:**</p>\n<p>- Demonstrates expert knowledge and understanding of financial measures, metrics and trends.</p>\n<p>- Demonstrates excellent project and program management skills.</p>\n<p>- Demonstrates excellent ability to manage ambiguity by operating effectively, even when things are not certain or the way forward is not clear.</p>\n<p>- Possesses an excellent understanding of confidentiality and how to exercise diplomacy.</p>\n<p>- Possesses expert ability to build and maintain productive cross-functional relationships.</p>\n<p>- Demonstrates an excellent process-oriented mindset with expert analytical and critical thinking skills.</p>\n<p>- Possesses excellent interpersonal, organizational, and collaborative skills, attentive to detail, and the ability to work independently and effectively in a fast-paced and highly dynamic environment.</p>\n<p>- Expert ability to prepare and deliver insights and recommendations based on analysis.</p>\n<p>- Excellent ability to lead teams of staff.</p>\n<p>**Background Check and Drug Testing Information:**</p>\n<p>CDM Smith Inc. and its divisions and subsidiaries (hereafter collectively referred to as “CDM Smith”) reserves the right to require background checks including criminal, employment, education, licensure, etc. as well as credit and motor vehicle when applicable for certain positions. In addition, CDM Smith may conduct drug testing for designated positions. Background checks are conducted after an offer of employment has been made in the United States. The timing of when background checks will be conducted on candidates for positions outside the United States will vary based on country statutory law but in no case, will the background check precede an interview. CDM Smith will conduct interviews of qualified individuals prior to requesting a criminal background check, and no job application submitted prior to such interview shall inquire into an applicant's criminal history. If this position is subject to a background check for any convictions related to its responsibilities and requirements, employment will be contingent upon successful completion of a background investigation including criminal history. Criminal history will not automatically disqualify a candidate. In addition, during employment individuals may be required by CDM Smith or a CDM Smith client to successfully complete additional background checks, including motor vehicle record as well as drug testing.</p>\n<p>**U.S. Vaccine Status:**</p>\n<p>CDM Smith Inc. and its divisions and subsidiaries (hereafter collectively referred to as “CDM Smith”) are committed to your health and safety. CDM Smith and its employees adhere to all applicable government and client COVID-19 requirements.</p>\n<p>**Additional Compensation:**</p>\n<p>All bonuses at CDM Smith are discretionary and may or may not apply to this position.</p>\n", "city": "El Paso", "state": "Texas", "country": "United States", "location": "El Paso, Texas", "function": "Finance", "logo": "https://www.localjobs.com/sites/default/files/company_logos/logo_21.jpg", "jobtype": "Full time", "education": null, "experience": null, "salary": null, "requiredlanguages": null, "requiredskills": null}, " Do not include the job description in your reply.\n\n{\n    \"education\": \"Bachelor's degree\",\n    \"experience\": \"10 years of relevant experience with at least two years of leading teams\",\n    \"salary\": null,\n    \"requiredLanguages\": null,\n    \"requiredSkills\": \"Project and program management, financial measures, metrics and trends, process-oriented mindset, analytical and critical thinking, interpersonal, organizational, and collaborative skills, attentive to detail, Oracle R12, Qlik Analytics, MS Office Suite\"\n}"][{"title": "Academic Faculty Opportunity - FM and NMM at AdventHealth East Orlando", "company": "AdventHealth", "posted_date": "8/14/22", "job_reference": "8339025", "req_number": "2522", "url": "https://www.localjobs.com/job/orlando-fl-academic-faculty-opportunity-fm-and-nmm-adventhealth-east-orlando", "body": "<p>**Academic Faculty Opportunity - FM and NMM at AdventHealth East Orlando**</p>\n<p>AdventHealth Graduate Medical Education in Orlando, Florida is looking for a dynamic, hardworking, and broadly skilled Family Medicine physician with a passion for teaching. This doctor would serve as one of the key faculty members in an academic role within the Osteopathic Family Medicine Residency Program. He or she would focus on outpatient medicine while teaching our residents and medical students. The physician's duties will include his or her own personal family medicine clinic, precepting residents and medical students, giving didactic lectures, constructing curriculum and evaluating residents and medical students. There is an opportunity to incorporate OMM into both clinical care and teaching.</p>\n<p>**The ideal candidate would have experience in academic medicine, demonstrate leadership capabilities, strong communication skills, and fit within the mission and vision of AdventHealth, formerly Florida Hospital. Bilingual in Spanish is preferred, but not necessary.**</p>\n<p>This well-established ACGME Accredited Family Medicine Residency with Osteopathic Recognition is based at AdventHealth East Orlando, a 293 bed facility that is part of one of the largest healthcare systems in the country. The Osteopathic Family Medicine Residency at AdventHealth East Orlando, which has been training residents for over 30 years, is among the most progressive training programs in the osteopathic profession. The foundation for our family medicine residency is derived from the dedication of our faculty, continuity family medicine and pediatric clinics, didactic programs and innovative technology. We teach twenty four residents each academic year, ONMM3 residents, and osteopathic medical students. We are a core site for third year students from the Kansas City University College of Osteopathic Medicine and the Dr. Kiran C. Patel College of Osteopathic Medicine at Nova Southeastern University.</p>\n<p>**Board Certification in Family Medicine (AOA or ABMS) is required.**</p>\n<p>**AOA certification or ABMS certification with OMM skills is preferred.**</p>\n<p>**NOTE: Not a J1 or H1 Opportunity**</p>\n<p>**Hospital Description**</p>\n<p>AdventHealth East Orlando, a 295-bed full service community hospital became part of the Adventist Health System in 1991. We are proud to serve approximately 180,000 patients annually, which include more than 16,500 inpatients and 79,330 outpatients at AdventHealth East Orlando. In addition, our emergency visits totaled over 130,000 in 2018.</p>\n<p>As a part of one of the fastest growing communities in Central Florida, our hospital caters to the east Orange County population. This market consists of the popular Waterford Lakes, Avalon Park, Lake Nona and University of Central Florida areas.</p>\n<p>AdventHealth East Orlando is the primary campus for approximately 275 physicians who can utilize our four, new inpatient surgical suites as well as our new technologically advanced 13,500 square foot Outpatient Surgery Center. Our specialized services include: Cardiovascular Institute, Cancer Institute, Orthopedic Institute, Respiratory Care, Center for Family Care, Radiology and Diagnostic Imaging, Rehabilitation and Sports Medicine, Men's and Women's Health Programs, Women's Health Pavilion, Hospice Care, Seizure Monitoring, Telemedicine Program, Digestive Health Services, Primary Stroke Center and Sleep Disorders Center.</p>\n<p>**Community Description**</p>\n<p>AdventHealth is conveniently close to many gorgeous homes, downtown urban living, shopping, and great schools. As one of the most visited American cities, Orlando has world-class attractions including Universal Studios, Walt Disney World, and easy access to both coasts for numerous world renown beaches. Orlando is home to major league soccer (Orlando City Lions), NBA basketball (Orlando Magic) as well as University of Central Florida sports. The city also has many public and private universities and colleges. The Dr. Phillips Center for Performing Arts hosts variety of musical and theatrical performances throughout the year.</p>\n<p>+ Hospital Website (<a href=\"https://www.adventhealth.com/hospital/adventhealth-east-orlando\">https://www.adventhealth.com/hospital/adventhealth-east-orlando</a>)</p>\n<p>+  Orange County Parks and Recreation</p>\n<p>+ Seminole County Parks and Recreation (<a href=\"http://www.seminolecountyfl.gov/departments-services/leisure-services/\">http://www.seminolecountyfl.gov/departments-services/leisure-services/</a>)</p>\n<p>+  Orange County Florida</p>\n<p>This facility is an equal opportunity employer and complies with federal, state and local anti-discrimination laws, regulations and ordinances.</p>\n<p>The salary range reflects the anticipated base pay range for this position. Individual compensation is determined based on skills, experience and other relevant factors within this pay range. The minimums and maximums for each position may vary based on geographical location</p>\n<p>**Category:**  Physician Services</p>\n<p>**Organization:**  AdventHealth Medical Group Central FL</p>\n<p>**Req ID:**  JID_3527055_11718</p>\n<p>We are an equal opportunity employer and do not tolerate discrimination based on race, color, creed, religion, national origin, sex, marital status, age or disability/handicap with respect to recruitment, selection, placement, promotion, wages, benefits and other terms and conditions of employment.</p>\n", "city": "Orlando", "state": "Florida", "country": "United States", "location": "Orlando, Florida", "function": "Healthcare", "logo": "https://www.localjobs.com/sites/default/files/company_logos/adventhealth.jpg", "jobtype": "Full time", "education": null, "experience": null, "salary": null, "requiredlanguages": null, "requiredskills": null}, " \n\n`{\n    \"education\": [\"board certification in family medicine (AOA or ABMS)\"],\n    \"experience\": \"academic medicine\",\n    \"salary\": null,\n    \"requiredlanguages\": [\"Spanish (preferred)\"],\n    \"requiredskills\": [\"Leadership\", \"Strong communication\", \"OMM\"]\n}`"][{"title": "CNA", "company": "Catholic Health Initiatives", "posted_date": "1/14/23", "job_reference": "10074828", "req_number": "2897", "url": "https://www.localjobs.com/job/kearney-ne-cna-13", "body": "<p>**CNA**</p>\n<p>Kearney, Nebraska</p>\n<p>CHI Health Good Samaritan</p>\n<p>**Share**</p>\n<p>+  Email</p>\n<p>+  LinkedIn</p>\n<p>+  Twitter</p>\n<p>+  Facebook </p>\n<p>**Partnering for a stronger, healthier world.**</p>\n<p>At CommonSpirit Health, we believe in the healing power of humanity. We invite you to explore our specialty areas and pursue a career in humankindness.</p>\n<p>+ Employment Type: Full Time</p>\n<p>+ Department: ICU/Med Surg</p>\n<p>+ Hours/Pay Period: 72</p>\n<p>The posted compensation range of $14.08 - $19.36 /hour is a reasonable estimate that extends from the lowest to the highest pay CommonSpirit in good faith believes it might pay for this particular job, based on the circumstances at the time of posting. CommonSpirit may ultimately pay more or less than the posted range as permitted by law.</p>\n<p>**Requisition ID** 2022-280182 **Employment Type** Full Time **Hours/Pay Period** 72 **Shift** Night **Weekly Schedule** 6:30pm-7am with rotating weekends and holidays **Remote** No **Category** ICU Nurse</p>\n<p>Already a CommonSpirit Employee? (<a href=\"https://www.commonspirit.careers/employee\">https://www.commonspirit.careers/employee</a>)</p>\n<p>**Job Details**</p>\n<p>**Overview**</p>\n<p>**Your time at work should be fulfilling.** Rewarding. Inspiring. That’s what you’ll find when you join one of our non-profit CHI facilities across the nation. You’ll find challenging, rewarding work every day alongside people who have as much compassion as you. Join us and together we’ll create healthier, stronger communities.</p>\n<p>Established by the Sisters of the St. Francis in 1924 CHI Health Good Samaritan is a 268-bed regional referral center in Kearney Neb. At CHI Health Good Samaritan you’ll find an advanced level trauma center that also offers AirCare emergency helicopter transport and an ambulance program providing long distance and local 911 service. Among our many other services are cardiac care including open-heart surgery a level II neonatal intensive care unit a nationally accredited cancer center comprehensive neurosurgery advanced orthopedic program and inpatient and outpatient mental health services at our free-standing Richard Young Behavioral Health facility.</p>\n<p>**Responsibilities**</p>\n<p>**$3,500 Sign-On Bonus available for external candidates!** </p>\n<p>We want our patients to be as comfortable as possible and believe that starts with basic patient care. We have the best team of nursing assistants in our facilities and now we need you. Our CNA’s not only collect patient information, but they also help them take their medications on time, assist with meals, attend to personal needs, and change wound dressings as needed. They play a vital role as a liaison between our patients and their care teams. If you are interested in joining this type of healthcare community, we want to talk to you.</p>\n<p>+ Contributes to the assessment of the health status of patients</p>\n<p>+ Communicates pertinent patient information to appropriate members of the treatment team with direction of the Charge Nurse</p>\n<p>+ Assist patients/families with light housekeeping duties such as assisting with meals or changing bed linens</p>\n<p>+ Reports any changes in a patient's condition to the Charge Nurse</p>\n<p>+ Must have ability to work effectively and collaboratively in a diverse and multi-cultural environment.</p>\n<p>**Qualifications**</p>\n<p>+ Must be at least 16 years of age</p>\n<p>+ Must have successfully completed the 75-hour state approved course for Nursing Assistant</p>\n<p>+ Must be active on the Nebraska Nurse Aide Registry</p>\n<p>+ BLS (Basic Life Support) through American Heart Association required</p>\n<p>**Nursing excellence**</p>\n<p>**starts with you.**</p>\n<p>Are you a career fit with our CommonSpirit Health culture? To understand how we are structured, we believe in some core philosophies with the following:</p>\n<p>We will **be stronger together,** achieving excellence in all we do, collaborating across the fields and growing our collective knowledge.</p>\n<p>We will **let humankindness guide us** as we treat every person with holistic, personalized care for the body, mind and spirit.</p>\n<p>We will **advance the science and art of nursing** as innovative leaders who demonstrate the power of evidence-based, compassionate care. If you believe in working together with humankindness for all to advance the science and art of nursing - then you have found your career fit with us!</p>\n<p>“Our hope is that you will always feel inspired, knowing you truly are the heart and soul of CommonSpirit.”</p>\n<p>– Kathleen D. Sanford, EVP, Chief Nursing Officer</p>\n<p>**Your Potential Career Path**</p>\n<p>This is a snapshot of your potential career path highlights the series of job positions that help you progress towards your goals and objectives. Ultimately, your career path depends on your career values and personal goals.</p>\n<p>**Success Profile**</p>\n<p>What makes a successful CNA at CHI Health Good Samaritan?</p>\n<p>+ Compassionate</p>\n<p>+ Trustworthy</p>\n<p>+ Proactive</p>\n<p>+ Collaborative</p>\n<p>+ Communicator</p>\n<p>+ Balanced</p>\n<p>**Our Total Reward Offerings**</p>\n<p>At CommonSpirit Health, your Total Rewards package includes compensation, benefits, retirement, wellness, leave, and other programs. Please explore what we have to offer below.</p>\n<p>**Pay and Recognition**</p>\n<p>**Balanced Life**</p>\n<p>**Well-Being**</p>\n<p>**Professional Growth**</p>\n<p>**Financial Future**</p>\n<p>**Dependent Care**</p>\n<p>**Map this location**</p>\n<p>Get an idea of what your daily routine can be like.</p>\n<p>Click Here  > </p>\n<p>No related jobs</p>\n<p>No recently viewed jobs</p>\n<p>You have no saved Jobs</p>\n<p>Get tailored job recommendations based on your interests.</p>\n<p>Get Started </p>\n<p>**Follow us on social media**</p>\n<p>+  LinkedIn</p>\n<p>+  Facebook</p>\n<p>+ Instagram (<a href=\"https://www.instagram.com/CSH\">https://www.instagram.com/CSH</a>\\_careers/)</p>\n<p>+  YouTube</p>\n<p>+ Glassdoor (<a href=\"https://www.glassdoor.com/Overview/Working-at-CommonSpirit-EI\">https://www.glassdoor.com/Overview/Working-at-CommonSpirit-EI</a>\\_IE2611593.11,23.htm) </p>\n<p>**Equal Opportunity**</p>\n<p>CommonSpirit Health™ is an Equal Opportunity/Affirmative Action employer committed to</p>\n<p>a diverse and inclusive workforce. All qualified applicants will be considered for</p>\n<p>employment without regard to race, color, religion, sex, sexual orientation, gender</p>\n<p>identity, national origin, age, disability, marital status, parental status,</p>\n<p>ancestry, veteran status, genetic information, or any other characteristic protected</p>\n<p>by law. For more information about your EEO rights as an applicant,</p>\n<p>pleaseclick here. (<a href=\"https://tbcdn.talentbrew.com/company/35300/img/v1\">https://tbcdn.talentbrew.com/company/35300/img/v1</a>\\_0/EEOC\\_KnowYourRightsEnglish.pdf) </p>\n<p>CommonSpirit Health™ will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information. 41 CFR 60-1.35(c).</p>\n<p>External hires must pass a post-offer, pre-employment background check/drug screen. Qualified applicants with an arrest and/or conviction will be considered for employment in a manner consistent with federal and state laws, as well as applicable local ordinances, ban the box laws, including but not limited to the San Francisco and Los Angeles Fair Chance Ordinances.</p>\n<p>If you need a reasonable accommodation for any part of the employment process, please contact us by telephone at (415) 438-5575 and let us know the nature of your request. We will only respond to messages left that involve a request for a reasonable accommodation in the application process. We will accommodate the needs of any qualified candidate who requests a reasonable accommodation under the Americans with Disabilities Act (ADA).</p>\n<p>CommonSpirit Health™ participates in E-Verify.</p>\n", "city": "Kearney", "state": "Nebraska", "country": "United States", "location": "Kearney, Nebraska", "function": "CNA", "logo": "https://www.localjobs.com/sites/default/files/company_logos/catholiclogo.jpg", "jobtype": "Full time", "education": null, "experience": null, "salary": null, "requiredlanguages": null, "requiredskills": null}, "\n\n```json\n{\n    \"education\": null,\n    \"experience\": \"Must be active on the Nebraska Nurse Aide Registry, BLS (Basic Life Support) through American Heart Association required\",\n    \"salary\": \"14.08 - 19.36/hour\",\n    \"requiredLanguages\": null,\n    \"requiredSkills\": \"Compassionate, Trustworthy, Proactive, Collaborative, Communicator, Balanced\"\n}\n```"][{"title": "Housekeeper Pelican Health Henderson", "company": "Aramark", "posted_date": "1/24/23", "job_reference": "10184080", "req_number": "2756", "url": "https://www.localjobs.com/job/henderson-nc-evs-specialist-pelican-health-henderson", "body": "<p>**Job Description**</p>\n<p>It’s time for a sweeping change to your career so that you can pursue what matters to you! At Aramark, making sure we provide clean environments is something in which we take pride and is a skill set that can help take you further in your career.</p>\n<p>As a professional Housekeeper on our team, you’ll take pride in cleaning and maintaining the cleanliness of our locations to help keep our guests happy and healthy. Integrity and attention to detail are also two must-have tools that you keep in your cleaning case.</p>\n<p>By helping us create clean, safe, and orderly environments for our guests, you’ll pave the way to more opportunities for yourself at Aramark!</p>\n<p>**Job Responsibilities**</p>\n<p>•    Maintains friendly, efficient, positive customer service demeanor toward customers, clients, and co-workers. Is adaptable to customer needs.</p>\n<p>•    Maintains all assigned ancillary and department areas and corridors in a clean neat and sanitary manner, to protect safety and health of others and in compliance with accurate preventative maintenance procedures as outlined in department policy.</p>\n<p>•    Inspects and uses judgment in determining which cleaning techniques outlined in orientation guidelines to follow.</p>\n<p>•    Demonstrates efficient and safe use of housekeeping equipment and solutions as observed by supervisor.</p>\n<p>•    May disinfect and sterilize equipment and supplies, using germicides and sterilizing equipment.</p>\n<p>•    Diligently employs universal precautions when disposing of trash and bio-hazardous materials.</p>\n<p>•    Keeps cart properly stocked with equipment and cleaning supplies; ensures all chemicals are accurately labeled, and all equipment is in good working condition.</p>\n<p>•    Promotes effective interpersonal and interdisciplinary relationships, maintains professional conduct at all times.</p>\n<p>•    Assists in improving productivity and efficient operations of the department.</p>\n<p>•    Demonstrates commitment to professional growth and competence by adherence to component and departmental training commitments.</p>\n<p>At Aramark, developing new skills and doing what it takes to get the job done make a positive impact for our employees and for our customers. In order to meet our commitments, job duties may change or new ones may be assigned without formal notice.</p>\n<p>**Qualifications**</p>\n<p>•    Past cleaning experience preferred</p>\n<p>•    Attention to detail</p>\n<p>•    Ability to communicate effectively with clients, senior management, and Aramark support staff</p>\n<p>•    Ability to respond effectively to changing demands</p>\n<p>This role may have physical demands including, but not limited to, lifting, bending, pushing, pulling and/or extended walking and standing. This role may also require uniforms and/or usage of Personal Protective Equipment (PPE).</p>\n<p>**Education**</p>\n<p>**About Aramark**</p>\n<p>**Our Mission**</p>\n<p>Rooted in service and united by our purpose, we strive to do great things for each other, our partners, our communities, and our planet.</p>\n<p>At Aramark, we believe that every employee should enjoy equal employment opportunity and be free to participate in all aspects of the company. We do not discriminate on the basis of race, color, religion, national origin, age, sex, gender, pregnancy, disability, sexual orientation, gender identity, genetic information, military status, protected veteran status or other characteristics protected by applicable law.</p>\n<p>**About Aramark**</p>\n<p>The people of Aramark proudly serve millions of guests every day through food, facilities, and uniform services in 19 countries around the world. Rooted in service and united by our purpose, we strive to do great things for each other, our partners, our communities, and our planet. We believe a career should develop your talents, fuel your passions, and empower your professional growth. So, no matter what you're pursuing - a new challenge, a sense of belonging, or just a great place to work - our focus is helping you reach your full potential. Learn more about working here at  <a href=\"http://www.aramarkcareers.com\">http://www.aramarkcareers.com</a>  or connect with us on  Facebook ,  Instagram  and  Twitter .</p>\n<p>Aramark is an EQUAL EMPLOYMENT OPPORTUNITY/AFFIRMATIVE ACTION employer – Minority/Female/Disability/Veteran</p>\n<p>Aramark will consider for employment qualified applicants with criminal histories in a manner consistent with the Los Angeles Fair Chance ordinance.</p>\n", "city": "Henderson", "state": "North Carolina", "country": "United States", "location": "Henderson, North Carolina", "function": "Uniform Service", "logo": "https://www.localjobs.com/sites/default/files/company_logos/aramarklogo250.gif", "jobtype": "Full time", "education": null, "experience": null, "salary": null, "requiredlanguages": null, "requiredskills": null}, "\n\n```\n{\n    \"education\": null,\n    \"experience\": \"Past cleaning experience preferred\",\n    \"salary\": null,\n    \"requiredLanguages\": null,\n    \"requiredSkills\": \"attention to detail, customer service, use of housekeeping equipment/solutions, ability to communicate effectively, adaptability\"\n}\n```"]