[{"title": "2023 Associate Industrial Security Analyst - Pathways Program - Rolling Meadows, IL", "company": "Northrop Grumman", "posted_date": "3/30/23", "job_reference": "10986656", "req_number": "4958", "url": "https://www.localjobs.com/job/rolling-meadows-il-2023-associate-industrial-security-analyst-pathways-program-rolling-meadows", "body": "<p>**Requisition ID: R10104318**</p>\n<p>+   **Category:**   Security</p>\n<p>+   **Location:**   Rolling Meadows, IL, USA</p>\n<p>+   **Citizenship Required:**   United States Citizenship</p>\n<p>+   **Clearance Type:**  Secret</p>\n<p>+   **Telecommute:**   No- Teleworking not available for this position</p>\n<p>+   **Shift:**   1st Shift (United States of America)</p>\n<p>+   **Travel Required:**   Yes, 10% of the Time</p>\n<p>At Northrop Grumman, our employees have incredible opportunities to work on revolutionary systems that impact people's lives around the world today, and for generations to come. Our pioneering and inventive spirit has enabled us to be at the forefront of many technological advancements in our nation's history - from the first flight across the Atlantic Ocean, to stealth bombers, to landing on the moon. We look for people who have bold new ideas, courage and a pioneering spirit to join forces to invent the future, and have fun along the way. Our culture thrives on intellectual curiosity, cognitive diversity and bringing your whole self to work - and we have an insatiable drive to do what others think is impossible. Our employees are not only part of history, they're making history.</p>\n<p>At the heart of Defining Possible is our commitment to missions. In rapidly changing global security environments, Northrop Grumman brings informed insights and software-secure technology to enable strategic planning. We're looking for innovators who can help us keep building on our wide portfolio of secure, affordable, integrated, and multi-domain systems and technologies that fuel those missions. By joining in our shared mission, we'll support yours of expanding your personal network and developing skills, whether you are new to the field or an industry thought-leader. At Northrop Grumman, you'll have the resources, support, and team to do some of the best work of your career.</p>\n<p>**Northrop Grumman is seeking Associate Pathways Security professional** . This position will be located at our Mission Systems Sector in Rolling Meadows, IL. This position will be in the Pathways rotational program where there will be three rotation opportunities within Mission Systems Security organization.</p>\n<p>The qualified candidate will become part of Northrop Grumman's Mission Systems Security Organization.</p>\n<p>Candidate will be exposed to the security statement of work for DoD Industrial Security with the opportunity to obtain knowledge and experience in other disciplines such as SAP, SCI, International, Counterintelligence, Physical and Technical Security, compliance and Security Operations</p>\n<p>**Basic Qualifications:**</p>\n<p>A candidate must meet ALL of the below criteria. The candidate must:</p>\n<p>+ Be completing or has completed their degree (Bachelor's, Master's, or PhD)</p>\n<p>+ Be majoring in or having majored in a Homeland Security, Criminal Justice or Business Administration degree.</p>\n<p>+ Have an overall cumulative GPA of 3.0/4.0 or higher (unofficial academic transcripts must be provided at time of application by uploading the documents to your application or profile)</p>\n<p>+ Be able to obtain a U.S. Government security clearance (U.S. citizenship is a pre-requisite)</p>\n<p>+ Able to work 40 hours a week full time.</p>\n<p>**Preferred Qualifications:**</p>\n<p>+ Have an overall cumulative GPA of 3.70/4.0 or higher</p>\n<p>+ Have an active DoD Secret or Top Secret clearance</p>\n<p>+ Completion of CDSE FSO Program Management for Possessing Facilities</p>\n<p>**Salary Range:**</p>\n<p>Level 1 $55,400 - $83,000</p>\n<p>Level 2 $67,000 - $100,400</p>\n<p>campusjobs</p>\n<p>**Salary Range:**   $55,400 USD - $100,400 USD</p>\n<p>Employees may be eligible for a discretionary bonus in addition to base pay. Annual bonuses are designed to reward individual contributions as well as allow employees to share in company results. Employees in Vice President or Director positions may be eligible for Long Term Incentives. In addition, Northrop Grumman provides a variety of benefits including health insurance coverage, life and disability insurance, savings plan, Company paid holidays and paid time off (PTO) for vacation and/or personal business.</p>\n<p>**The health and safety of our employees and their families is a top priority** . The company encourages employees to remain up-to-date on their COVID-19 vaccinations. U.S. Northrop Grumman employees may be required, in the future, to be vaccinated or have an approved disability/medical or religious accommodation, pursuant to future court decisions and/or government action on the currently stayed federal contractor vaccine mandate under Executive Order 14042 <a href=\"https://www.saferfederalworkforce.gov/contractors/\">https://www.saferfederalworkforce.gov/contractors/</a> .</p>\n<p>Northrop Grumman is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class. For our complete EEO/AA and Pay Transparency statement, please visit <a href=\"http://www.northropgrumman.com/EEO\">http://www.northropgrumman.com/EEO</a> . U.S. Citizenship is required for most positions.</p>\n", "city": "Rolling Meadows", "state": "Illinois", "country": "United States", "location": "Rolling Meadows, Illinois", "function": "Aerospace", "logo": "https://www.localjobs.com/sites/default/files/company_logos/northropelogo.jpg", "jobtype": "Full time", "education": null, "experience": null, "salary": null, "requiredlanguages": null, "requiredskills": null}, "\n\n```json\n{\n    \"education\": \"Bachelor's, Master's, or PhD\", \n    \"experience\": null, \n    \"salary\": \"$55,400 USD - $100,400 USD\", \n    \"requiredLanguages\": null, \n    \"requiredSkills\": \"Homeland Security, Criminal Justice or Business Administration degree, DoD Industrial Security, SAP, SCI, International, Counterintelligence, Physical and Technical Security, compliance and Security Operations\" \n}\n```"]
[{"title": "Senior Director, US-Canada Technology Services - Gaylord", "company": "Marriott", "posted_date": "4/1/23", "job_reference": "11011050", "req_number": "3970", "url": "https://www.localjobs.com/job/baton-rouge-la-senior-director-us-canada-technology-services-gaylord", "body": "<p>**Job Number**  23054570</p>\n<p>**Job Category**  Information Technology</p>\n<p>**Location**  Marriott International HQ, 7750 Wisconsin Avenue, Bethesda, Maryland, United States</p>\n<p>**Schedule**  Full-Time</p>\n<p>**Located Remotely?**  Y</p>\n<p>**Relocation?**  N</p>\n<p>**Position Type**  Management</p>\n<p>﻿</p>\n<p>**JOB SUMMARY**</p>\n<p>This role is the senior-most technology leader for the Gaylord brand and, through leadership and collaboration with on-property technology staff, manages programs, delivers initiatives, defines day-to-day support processes, and serves as escalation across the Gaylord portfolio. Develops technology strategy for the brand that is aligned with broader US-Canada tech strategy and ensures alignment with VP and Managing Partner of Gaylord hotels and leaders within Ryman Hospitality. Drives innovative business process and vendor management to increase overall IT effectiveness and productivity that contribute to improved revenue for the brand cost savings in negotiated contracts and to assist with revenue generating possibilities. Participates and provides technology thought leadership to the Gaylord Brand Team on technology opportunities to expand revenue opportunities and continuous improvement on guest “intent to recommend” scores.</p>\n<p>**CANDIDATE PROFILE**</p>\n<p>**Education and Experience**</p>\n<p>**Required:**</p>\n<p>1. 10 years’ progressive technology leadership experience including direct management of teams and budget ($1M+).</p>\n<p>2. 2+ years’ project management experience</p>\n<p>3. 2+ years’ experience in defining and documenting requirements (system, project, etc.)</p>\n<p>4. 2+ years’ experience in IT strategic planning</p>\n<p>5. Ability to travel up to 20%.</p>\n<p>6. Related undergraduate degree (computer sciences, MIS or business administration) or the equivalent training, experience, certifications</p>\n<p>**Preferred Skills and Attributes**</p>\n<p>+ Graduate level training/degree</p>\n<p>+ Project Management certification.</p>\n<p>+ Ability to influence others and build sponsorship for key initiatives/programs.</p>\n<p>+ Ability to implement change and effect accountability.</p>\n<p>+ Ability to quickly gain a clear and comprehensive understanding of Lodging and Brand strategies, priorities and initiatives and represent them to various constituencies across the organization</p>\n<p>+ Strong analytical skills for planning, estimating, budgeting and monitoring program/project work</p>\n<p>+ Strategic thinker, strong negotiator, collaborative and creative abilities. Ability to influence without authority.</p>\n<p>+ Strong executive presence – able to sell ideas and influence persuasively, settling differences and winning concessions without damaging relationships; can be both direct and forceful while remaining diplomacy.</p>\n<p>+ Builds relationships across a matrix and diverse work environment to include a broad group of stakeholders.</p>\n<p>+ Understands and effectively manages in a virtual work environment.</p>\n<p>+ Demonstrate a Strategic and Global mindset</p>\n<p>+ Ability to form and foster high performing teams</p>\n<p>+ Strong written and verbal communication and presentation skills</p>\n<p>+ Experience within Lodging or Hospitality industries, specifically Gaylord Hotels if possible.</p>\n<p>**CORE WORK ACTIVITIES**</p>\n<p>1. Provides accurate, relevant, and timely information for the assigned business stakeholders</p>\n<p>2. Consults with Gaylord, Continent, and Global Tech leadership on needs in support of their business processes and direction and implements solutions to meet the business needs</p>\n<p>3. Collaborates with Global Technology to provide an informed technical perspective to information needs along with cost/benefits understanding in an influencing and negotiating role.</p>\n<p>4. Confirms property systems staff workload and priorities and ensures coverage from shared services or property systems staff.</p>\n<p>5. Functions in a technical mentor (indirect reports and hourly tech), educating customers in information technology and its costs/benefit to their organization. Resolves conflicts of interest between IT and the client.</p>\n<p>6. Provides brand-wide project leadership by developing specific assignments with completion deadlines and setting standards for measuring performance.  Resolves conflicts within the team and within IT organizations.  Advises project leader as to the project team expertise required.  Participates in projects led by other IT team members, assigning resources as appropriate.</p>\n<p>7. Leads region-wide task force efforts, contributing to the definition of IT services and/or service enhancements</p>\n<p>8. Provides oversight and recommendations to property IT budgets</p>\n<p>**IT Security**</p>\n<p>1. Validates compliance with all data and physical security policies; stays abreast of annual changes and updates to those policies.</p>\n<p>2. Validate that property leaders understand and remediates security issues uncovered and that action plans are funded, implemented, and completed. Provides education to operations leaders</p>\n<p>3. Confirms that Property Technology and Information Risk Assessments are completed annually and that remediation where necessary is completed.</p>\n<p>**Vendor Management**</p>\n<p>1. Drives and validates compliance with vendor management policies/contracts (e.g., local systems, property-based tech).</p>\n<p>2. Leverages vendors and consultants to obtain technology expertise and consultation on specific application issues requiring industry research or technology understanding.</p>\n<p>**Building Relationships**</p>\n<p>1. Maintains positive relationships that foster open communication with IT organizations. Shares industry and competitive activity that has potential impact on IT.</p>\n<p>2. Establishes and nurtures working relationships with lodging partners</p>\n<p>3. Develops and maintains positive relations with clients.</p>\n<p>4. Integrates successfully and adds value as a team member within the Gaylord Brand Team.</p>\n<p>5. Develops strong working relationship with Ryman Hospitality, Gaylord Hotel GMs and Gaylord Managing Director.</p>\n<p>**Leadership**</p>\n<p>1. Sets priorities and communicates needs with VP, US-Canada IT, and all other areas of the Global Technology organization.</p>\n<p>2. Develops standards for measuring performance, monitors job performance and takes corrective action when necessary. Provides leadership for setting long-term goals and project completion deadlines.</p>\n<p>3. Builds a high-performing technology team that possesses the skills and capabilities to identify and meet client needs.</p>\n<p>4. and ensures the resources required to meet operational needs are provided in a cohesive and timely manner.</p>\n<p>5. Responsible for all work performed by regional IT staff and fosters the development of high professional standards for systems support and service personnel.  Identifies training needs for IT staff in the region</p>\n<p>**Managing Projects and Priorities**</p>\n<p>+ Develops specific goals and plans to prioritize, organize, and accomplish work for self and direct reports.</p>\n<p>+ Provides direction and assistance to other teams regarding projects. Determines priorities, schedules, plans and necessary resources to ensure completion of any projects on schedule.</p>\n<p>+ Analyzes information and evaluates results to choose the best solution and solve problems.</p>\n<p>+ Thinks creatively and practically to develop, execute and implement new plans or programs. Generates and provides accurate and timely results in the form of reports, presentations, etc.</p>\n<p>+ Plans, develops, implements, and evaluates the quality of the teams’ operations.</p>\n<p>+ Provides recommendations to improve the effectiveness of processes or programs.</p>\n<p>+ Understands and meets the needs of key stakeholders.</p>\n<p>+ Supports achievement of performance goals, budget goals, team goals, etc.</p>\n<p>**Leading Discipline Team**</p>\n<p>+ Champions leaders’ vision for product and service delivery.</p>\n<p>+ Works with direct reports and peers to develop and implement strategies and goals.  Communicates a clear and consistent message regarding goals to produce desired results.</p>\n<p>+ Makes and executes the necessary decisions to keep team moving forward toward achievement of goals.</p>\n<p>+ Provides targeted and timely communication of results, achievements and challenges to direct reports, peers, and leaders.</p>\n<p>**Managing and Conducting Human Resources Activities**</p>\n<p>+ Participates in interviews and selection of property tech associates.</p>\n<p>+ Promotes the fair and equitable treatment of employees.</p>\n<p>+ Facilitates regular, ongoing communication in department (e.g., staff meetings).</p>\n<p>+ Fosters employee commitment to providing excellent service, participates in daily stand-up meetings and models desired service behaviors in all interactions with customer and employees.</p>\n<p>+ Incorporates customer satisfaction as a component of staff/operations meetings with an emphasis on generating innovative ways to continually improve results.</p>\n<p>+ Sets goals and expectations for direct reports using the performance review process and holds staff accountable for performance goals.</p>\n<p>+ Solicits employee feedback.</p>\n<p>+ Utilizes an “open door policy” and reviews employee satisfaction results to identify and address employee problems or concerns</p>\n<p>+ Promotes adherence to policies consistently, follows disciplinary procedures and documents items according to Standard and Local Operating</p>\n<p>Procedures (SOPs and LSOPs) and supports the Peer Review Process.</p>\n<p>+ Conducts annual performance appraisal with direct reports according to Standard Operating Procedures.</p>\n<p>+ Champions change ensures brand and regional business initiatives are implemented and communicates follow-up actions to team as necessary.</p>\n<p>+ Identifies talents of direct reports and their teams and assists with their growth and development plans.</p>\n<p>_Marriott International is an equal opportunity employer. We believe in hiring a diverse workforce and sustaining an inclusive, people-first culture. We are committed to non-discrimination on any protected basis, such as disability and veteran status, or any other basis covered under applicable law. Marriott International considers for employment qualified applicants with criminal histories consistent with applicable federal, state and local law._</p>\n<p>Marriott International is the world’s largest hotel company, with more brands, more hotels and more opportunities for associates to grow and succeed.  We believe a great career is a journey of discovery and exploration.  So, we ask, where will your journey take you?</p>\n", "city": "Baton Rouge", "state": "Louisiana", "country": "United States", "location": "Baton Rouge, Louisiana", "function": "Food Service", "logo": "https://www.localjobs.com/sites/default/files/company_logos/logo_54.jpg", "jobtype": "Full time", "education": null, "experience": null, "salary": null, "requiredlanguages": null, "requiredskills": null}, "\n\n```json\n{\n    \"education\": [\"Undergraduate degree (computer sciences, MIS or business administration)\", \"Graduate level training/degree\"],\n    \"experience\": [\"10 years' progressive technology leadership experience including direct management of teams and budget ($1M+)\", \"2+ years' project management experience\", \"2+ years' experience in defining and documenting requirements (system, project, etc.)\", \"2+ years' experience in IT strategic planning\"],\n    \"salary\": null,\n    \"requiredLanguages\": null,\n    \"requiredSkills\": [\"Ability to influence others and build sponsorship for key initiatives/programs\", \"Ability to implement change and effect accountability\", \"Ability to quickly gain a clear and comprehensive understanding of Lodging and Brand strategies, priorities and initiatives and represent them to various constituencies across the organization\", \"Strong analytical skills for planning, estimating, budgeting and monitoring program/project work\", \"Strategic thinker, strong negotiator, collaborative and creative abilities. Ability to influence without authority.\", \"Builds relationships across a matrix and diverse work environment to include a broad group of stakeholders.\", \"Understands and effectively manages in a virtual work environment.\", \"Demonstrate a Strategic and Global mindset\", \"Ability to form and foster high performing teams\", \"Strong written and verbal communication and presentation skills\", \"Experience within Lodging or Hospitality industries, specifically Gaylord Hotels if possible.\"]\n}\n```"]
[{"title": "Manager V, Logistics Operations (M5)", "company": "Applied Materials", "posted_date": "3/15/23", "job_reference": "10841611", "req_number": "3402", "url": "https://www.localjobs.com/job/salem-or-manager-v-logistics-operations-m5", "body": "<p>**Key Responsibilities**</p>\n<p>Manage a Logistics Team with overall responsibility for oversight of physical Inventory Control</p>\n<p>Implement Lean in-bound transportation concepts in partnership with key suppliers, and Third Party Logistics.</p>\n<p>Implement Lean out-bound transportation concepts in partnership with field support organization (FSO), key customers, and 3PLs.</p>\n<p>Manage major Logistics focused Continual Improvement and Cost Reduction Projects as assigned.</p>\n<p>Ensure compliance and control to Quality Standards</p>\n<p>Attend Trade council and Logistics council meetings to ensure corporate/ regional alignment</p>\n<p>Work closely with Inventory Management to meet customer contractual agreement.</p>\n<p>Development and delivery of process training across all levels of staff.</p>\n<p>**Functional Knowledge**</p>\n<p>+ Demonstrates comprehensive understanding of concepts and principles within own job family and knowledge of other related job families</p>\n<p>**Business Expertise**</p>\n<p>+ Applies in-depth understanding of how own discipline integrates within the segment/function</p>\n<p>**Leadership**</p>\n<p>+ Manages multiple related teams, sets organizational priorities and allocates resources</p>\n<p>**Problem Solving**</p>\n<p>+ Identifies and resolves complex technical, operational and organizational problems</p>\n<p>**Impact**</p>\n<p>+ Impacts the business results of a team or area by supporting and funding of projects, products, services and/or technologies and developing policies and plansGuided by business unit, department or sub-functional business plans</p>\n<p>**Interpersonal Skills**</p>\n<p>+ Influences others internally and externally, including senior management</p>\n<p>Position requires understanding of Applied Materials global Standards of Business Conduct and compliance with these standards at all times. This includes demonstrating the highest level of ethical conduct reflecting Applied Materials' core values.</p>\n<p>\\#LI</p>\n<p>**Qualifications**</p>\n<p>**Education:**</p>\n<p>Bachelor's Degree</p>\n<p>**Skills**</p>\n<p>**Certifications:**</p>\n<p>**Languages:**</p>\n<p>**Years of Experience:**</p>\n<p>10 - 15 Years</p>\n<p>**Work Experience:**</p>\n<p>**Additional Information**</p>\n<p>**Travel:**</p>\n<p>Yes, 25% of the Time</p>\n<p>**Relocation Eligible:**</p>\n<p>No</p>\n<p>**U.S. Salary Range:**</p>\n<p>$124,000.00 - $170,500.00</p>\n<p>The salary offered to a selected candidate will be based on a number of factors including location and level and will vary depending on confirmed job-related knowledge, skills, and experience. In addition to a comprehensive benefits package, candidates may be eligible for other forms of compensation such as participation in a bonus and a stock award program, as applicable.</p>\n<p>Applied Materials is an Equal Opportunity Employer committed to diversity in the workplace. All qualified applicants will receive consideration for employment without regard to race, color, national origin, citizenship, ancestry, religion, creed, sex, sexual orientation, gender identity, age, disability, veteran or military status, or any other basis prohibited by law.</p>\n<p>Applied Materials is the leader in materials engineering solutions used to produce virtually every new chip and advanced display in the world. Our expertise in modifying materials at atomic levels and on an industrial scale enables customers to transform possibilities into reality. At Applied Materials, our innovations Make Possible a Better Future.</p>\n", "city": "Salem", "state": "Oregon", "country": "United States", "location": "Salem, Oregon", "function": "Management/Manager", "logo": "https://www.localjobs.com/sites/default/files/company_logos/logo_14.jpg", "jobtype": "Full time", "education": null, "experience": null, "salary": null, "requiredlanguages": null, "requiredskills": null}, "\n\n{\n  \"education\": \"Bachelor's Degree\",\n  \"experience\": \"10 - 15 Years\",\n  \"salary\": \"$124,000.00 - $170,500.00\",\n  \"requiredLanguages\": null,\n  \"requiredSkills\": \"Lean, Logistics, Quality Standards, Inventory Control\",\n}"]
[{"title": "Intelligence Analyst", "company": "Leidos", "posted_date": "3/3/23", "job_reference": "10714570", "req_number": "3112", "url": "https://www.localjobs.com/job/mclean-va-intelligence-analyst-1", "body": "<p>Description </p>\n<p>Job Description:</p>\n<p> At Leidos, we deliver innovative solutions through the efforts of our diverse and talented people who are dedicated to our customers’ success. We empower our teams, contribute to our communities, and operate sustainable practices. Everything we do is built on a commitment to do the right thing for our customers, our people, and our community. Our Mission, Vision, and Values guide the way we do business. Employees enjoy career enrichment opportunities available through mobility and development and experience rewarding relationships with supportive supervisors and talented colleagues and customers. Your most important work is ahead. </p>\n<p> If this sounds like the kind of environment where you can thrive, keep reading! </p>\n<p> Leidos is seeking experienced Intelligence Analysts for our client’s operational requirements on a mission focused program within a challenging, dynamic setting located in the Virginia and Maryland area. Successful candidates in this position will collaborate with a diverse group of individuals across the intelligence community and directly contribute to processes that shape government policy. Candidates will conduct in-depth research, perform rigorous time sensitive analysis, and distill this analysis into actionable insights. Specific areas of expertise and support are need in the following areas: </p>\n<p>+ Functional expertise in one of the following: Aviation, Climate & Global issues. Counterintelligence, Cyber Threat Intelligence, Economic Security and Financial Intelligence, Emerging & Disruptive Technologies Maritime, Space, and Supply Chain</p>\n<p>+  Regional expertise in one or more designated or functional areas of responsibility (AORs) </p>\n<p>+  Works to achieve day-to-day objectives with major impact on the area of responsibility. </p>\n<p>+  Responsible for entire projects or processes spanning multiple professional areas. </p>\n<p>+  Typically responsible for coaching, reviewing and delegating work to lower level professionals. </p>\n<p>+  Problems typically involve multiple issues, areas or specialties. </p>\n<p>+  Makes significant improvements in programs, processes, and solutions to enhance results. </p>\n<p>+  Utilizes expert knowledge of and ability to apply advanced principles, and concepts of a professional family. </p>\n<p> Primary Responsibilities: Intelligence Analysis </p>\n<p>+  We are seeking skilled intelligence professionals with in-depth knowledge related to one or more of the designated regional or functional areas of responsibility (AOR). Provide all-source analytic support to the Sponsor on a range of topics. This will require producing highly technical or specialized products and producing and giving briefings for a wide range of customers. </p>\n<p> Basic Qualifications: </p>\n<p>+ TS/SCI with Poly</p>\n<p>+  Experience with analysis </p>\n<p>+  Experience with working in the Intelligence Community </p>\n<p>+  Experience with conceptualization and assessing qualitative and quantitative information </p>\n<p>+  Experience with writing and briefing </p>\n<p>+  Experience with regional or functional topics </p>\n<p>+  Knowledge of intelligence priority topics and supporting intelligence information needs </p>\n<p>+  Typically requires a BA degree and 8-12 years of prior relevant experience or Masters with 6-10 years of prior relevant experience. Experience may be exchanged for degree requirements. </p>\n<p>Pay Range:Pay Range $84,500.00 - $130,000.00 - $175,500.00</p>\n<p> The Leidos pay range for this job level is a general guideline onlyand not a guarantee of compensation or salary. Additional factors considered in extending an offer include (but are not limited to) responsibilities of the job, education, experience, knowledge, skills, and abilities, as well as internal equity, alignment with market data, applicable bargaining agreement (if any), or other law. </p>\n<p> REQNUMBER: R-00105864-OTHLOC-PL-2D1715</p>\n<p>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status. Leidos will consider qualified applicants with criminal histories for employment in accordance with relevant Laws. Leidos is an equal opportunity employer/disability/vet.</p>\n", "city": "McLean", "state": "Virginia", "country": "United States", "location": "McLean, Virginia", "function": "Business Analyst", "logo": "https://www.localjobs.com/sites/default/files/company_logos/logo_200x200.png", "jobtype": "Full time", "education": null, "experience": null, "salary": null, "requiredlanguages": null, "requiredskills": null}, "\n\n{ \n    \"education\": \"BA degree and 8-12 years of prior relevant experience or Masters with 6-10 years of prior relevant experience\",\n    \"experience\": \"8-12 years\",\n    \"salary\": \"$84,500.00 - $130,000.00 - $175,500.00\",\n    \"requiredLanguages\": null,\n    \"requiredSkills\": \"Analysis, Intelligence Community, Conceptualization, Assessing Qualitative and Quantitative Information, Writing and Briefing, Regional or Functional Topics, Intelligence Priority Topics\",\n}"]
