[{"title": "Accounts Receivable Representative", "company": "Cintas", "posted_date": "1/29/23", "job_reference": "10252895", "req_number": "4243", "url": "https://www.localjobs.com/job/lebanon-tn-accounts-receivable-representative-0", "body": "<p>**Requisition Number:**  135713</p>\n<p>**Job Description**</p>\n<p>Cintas is seeking an Accounts Receivable Representative. Responsibilities include all accounts receivable related functions, including keeping track of assigned accounts to identify outstanding debts; planning course of action to recover outstanding payments; heavy phone activity with customers; locating and contacting debtors regarding payment status; negotiating payoff deadlines or payment plans; handling questions or complaints; investigating and resolving discrepancies; establishing good relationships with customers; updating account status and database regularly; alerting supervisors of customers unwilling or unable to pay outstanding amounts; complying with requirements when legal action is unavoidable.</p>\n<p>**Skills/Qualifications**</p>\n<p>Required</p>\n<p>+ High School Diploma/GED</p>\n<p>+ 2+ years' collections experience</p>\n<p>+ Ability to use confidential information in a professional manner to achieve collections targets/goals</p>\n<p>+ Proficiency with Microsoft Office (Excel, Word, Outlook) and intranet/internet</p>\n<p>Preferred</p>\n<p>+ Accuracy and attention to detail</p>\n<p>+ Excellent internal and external customer service skills</p>\n<p>+ Experience with SAP and AS400</p>\n<p>Cintas offers comprehensive and competitive medical, dental and vision benefits, featuring employee health care premiums that are 30% lower than the national average for our industry.  One of our medical plan options is even offered at zero cost to our partners.</p>\n<p>Additionally, our employee-partners enjoy:</p>\n<p>•    Competitive Pay</p>\n<p>•    401(k)/Profit Sharing/Employee Stock Ownership Program</p>\n<p>•    Disability and Life Insurance Packages</p>\n<p>•    Paid Time Off and Holidays</p>\n<p>•    Career Advancement Opportunities</p>\n<p>Headquartered in Cincinnati, Cintas is a publicly held company traded over the Nasdaq Global Select Market under the symbol CTAS and is a component of both the Standard & Poor’s 500 Index and Nasdaq-100 Index.</p>\n<p>Cintas Corporation helps more than 900,000 businesses of all types and sizes get READY™ to open their doors with confidence every day by providing a wide range of products and services that enhance our customers’ image and help keep their facilities and employees clean, safe and looking their best. With products and services including uniforms, mats, mops, restroom supplies, first aid and safety products, fire extinguishers and testing, and safety and compliance training, Cintas helps customers get Ready for the Workday®.</p>\n<p>To support our growth across North America, we’re seeking driven professionals with ambition to move up within our company. Our professional culture, our dedication to our employee-partners and limitless career opportunities—these are just a few benefits we’re proud to offer. Our employee-partners know every job is critical, and that teamwork drives innovation. Let’s talk about how you’ll fit into our team and how your hard work will be recognized through competitive pay, world-class benefits and ongoing career development. Are you Ready™ for limitless opportunities at Cintas?</p>\n<p>Cintas Corporation is an EEO/Affirmative Action Employer and will make all employment-related decisions without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.</p>\n<p>**Job Category:**  Office Administration</p>\n<p>**Organization:**  Rental</p>\n<p>**Employee Status:**  Regular</p>\n<p>**Schedule:**  Full Time</p>\n<p>**Shift:**  1st Shift</p>\n", "city": "Lebanon", "state": "Tennessee", "country": "United States", "location": "Lebanon, Tennessee", "function": "Bookkeeping", "logo": "https://www.localjobs.com/sites/default/files/company_logos/cintaslogo_0.jpg", "jobtype": "Full time", "education": null, "experience": null, "salary": null, "requiredlanguages": null, "requiredskills": null}, "\n\n`\n{\n \"education\": \"High School Diploma/GED\",\n \"experience\": \"2+ years' collections experience\",\n \"salary\": null,\n \"requiredLanguages\": null,\n \"requiredSkills\": \"Accuracy and attention to detail,Excellent internal and external customer service skills,Experience with SAP and AS400\"\n}\n`"]
[{"title": "Warehouse Worker - Package Handler", "company": "UPS", "posted_date": "4/20/23", "job_reference": "11209173", "req_number": "2777", "url": "https://www.localjobs.com/job/kahului-hi-warehouse-worker-package-handler-1", "body": "<p>$21 / hour</p>\n<p>Shift: Night (12:00 AM - 5:00 AM)</p>\n<p>**Air Ramp Package Handlers**</p>\n<p>UPS is hiring individuals to work as  **Part-time Package Handlers**  or  **Part-time AIR Ramp Package Handlers.**  These  **Part-time AIR Ramp Package Handlers**  or  **Package Handlers**  work  **outside on the ramp operation**  and must have a valid driver’s license.  This is a physical, fast paced position that involves continual lifting, lowering and sliding packages that typically weigh 25 – 35lbs. and may weigh up to 70 lbs. All shifts work 5 mornings or evenings per week for 3 to 4 hours per day depending on package volume. Please note that these opportunities are part-time only working an average work week of approximately 15 to 20 hours. During peak periods, you might work up to 25 hours per week.</p>\n<p>If you’re a student at an approved college, university, trade or technical school, UPS offers an educational assistance program that could provide you with up to $25,000 for tuition, books and fees. If you qualify, you’ll be eligible for the program on your first day of work at UPS.</p>\n<p>UPS is an equal opportunity employer. UPS does not discriminate on the basis of race/color/religion/sex/national origin/veteran/disability/age/sexual orientation/gender identity or any other characteristic protected by law</p>\n<p>**Company:** UNITED PARCEL SERVICE</p>\n<p>**Category:** Warehouse Worker - Package Handler</p>\n<p>**Requisition Number:** HIKAH1</p>\n<p>**Location:** Kahului,Hawaii</p>\n", "city": "Kahului", "state": "Hawaii", "country": "United States", "location": "Kahului, Hawaii", "function": "Business Services", "logo": "https://www.localjobs.com/sites/default/files/company_logos/ups-logo250.jpg", "jobtype": "Full time", "education": null, "experience": null, "salary": null, "requiredlanguages": null, "requiredskills": null}, "\n\n`\n{\n    \"education\": \"null\",\n    \"experience\": \"null\",\n    \"salary\": \"$21/hour\",\n    \"requiredLanguages\": \"null\",\n    \"requiredSkills\": \"lifting, lowering and sliding packages, valid driver's license\",\n    \"shift\": \"Night (12:00 AM - 5:00 AM)\"\n}\n`"]
[{"title": "Clinical Informatics Specialist", "company": "Baylor Scott & White Health", "posted_date": "3/24/23", "job_reference": "10930789", "req_number": "2820", "url": "https://www.localjobs.com/job/college-station-tx-clinical-informatics-specialist", "body": "<p>**JOB SUMMARY**</p>\n<p>The Clinical Informatics Specialist promotes the understanding, integration and application of healthcare information technology in support of clinician/provider objectives, the organization's vision and strategic goals and industry best practices. This position drives the optimal, efficient and effective use of clinical information systems and technology as it relates to patient care, patient safety, user satisfaction, clinical productivity and quality outcomes. Serves as a key constituent that bridges the gap between people, process, clinical knowledge and technology.</p>\n<p>**ESSENTIAL FUNCTIONS OF THE ROLE**</p>\n<p>Utilizes knowledge of BSWH policies, procedures and processes to provide support/guidance/feedback for process improvements, user acceptance testing, education, and implementation/upgrade support. Understands one or more service line workflows and impacts to technology. Support the operational advocate for a service line, POD participant. Participates in user acceptance testing.</p>\n<p>Demonstrates understanding of one or more health care regulations and the impact on end user workflows and existing functionality through participation in journal clubs, debates or other health informatics supported educational workshops.</p>\n<p>Assists with the investigation and statement of problems. Able to solve more complex problems extending across single service lines/business units. Frequently seeks advice from peers and direct supervisor. Follows-up with customers during and after the delivery of services to ensure that their needs have been met.</p>\n<p>Demonstrates ability to organize project tasks against project milestones and deliverables with minimal supervision. Manages time to meet all project milestones and deliverable dates. Escalates issues with task assignment and milestones appropriately. Seeks out opportunities to lead low complexity enhancements or specific activities associated with a project.</p>\n<p>Collaborates with EPIC training team and CIL/CIM to develop leader/clinical communication Assists with discovery and design sessions. Develops basic presentation and meeting facilitation skills. Displays a positive attitude in the face of ambiguity and change.</p>\n<p>Serves as a resource to end users for information systems and technology. Completes rounding in assigned inpatient/outpatient areas.</p>\n<p>Provides ongoing support for all upgrades, new releases and enhanced functionality. Effectively communicates system changes, workflow process changes, downtime procedures, etc. to all clinicians/ providers.</p>\n<p>Participates in CI council. Assumes additional responsibilities to facilitate the achievement of team goals.</p>\n<p>Sets clear self-development expectations. Demonstrates initiative in professional self-development. Initiates collaboration with others and spontaneously assists others in the delivery of their work.</p>\n<p>**KEY SUCCESS FACTORS**</p>\n<p>Two or more years of experience in a clinical environment required. Two or more years of experience working in informatics role preferred.</p>\n<p>Bachelor's degree in healthcare related field preferred.</p>\n<p>Licensed clinician such as nurse, physical therapist, occupational therapist, pharmacy technician, dietitian, respiratory therapist, etc. preferred.</p>\n<p>Excellent communication (verbal and written), interpersonal and organizational skills.</p>\n<p>Self-directed with excellent organization, analytical and interpersonal skills.</p>\n<p>Sound understanding of clinical practice as it pertains to the integration of clinical information systems/technology and impact on end users.</p>\n<p>Able to effectively utilize resources with fiscal responsibility in planning, implementation, and evaluation.</p>\n<p>Strong critical thinking and problem-solving skills.</p>\n<p>Knowledge of clinical practice issues and compliance with current standards/competencies and regulatory bodies.</p>\n<p>Able to manage multiple projects.</p>\n<p>**Location: College Station (main site) and Brenham**</p>\n<p>**Schedule: Full Time, M-F**</p>\n<p>**BENEFITS**</p>\n<p>Our competitive benefits package includes the following</p>\n<p>- Immediate eligibility for health and welfare benefits</p>\n<p>- 401(k) savings plan with dollar-for-dollar match up to 5%</p>\n<p>- Tuition Reimbursement</p>\n<p>- PTO accrual beginning Day 1</p>\n<p>Note: Benefits may vary based upon position type and/or level</p>\n<p>**QUALIFICATIONS**</p>\n<p>- EDUCATION - Bachelor's or 4 years of work experience above the minimum qualification</p>\n<p>- EXPERIENCE - 2 Years of Experience</p>\n<p>As a health care system committed to improving the health of those we serve, we are asking our employees to model the same behaviours that we promote to our patients. As of January 1, 2012, Baylor Scott & White Health no longer hires individuals who use nicotine products. We are an equal opportunity employer committed to ensuring a diverse workforce. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law.</p>\n", "city": "College Station", "state": "Texas", "country": "United States", "location": "College Station, Texas", "function": "Healthcare", "logo": "https://www.localjobs.com/sites/default/files/company_logos/baylorscott250.jpg", "jobtype": "Full time", "education": null, "experience": null, "salary": null, "requiredlanguages": null, "requiredskills": null}, "\n\n```\n{\n    \"education\": \"Bachelor's\",\n    \"experience\": \"2 Years\",\n    \"salary\": null,\n    \"requiredLanguages\": null,\n    \"requiredSkills\": \"clinical informatics, healthcare IT, clinical information systems/technology, organizational skills, problem-solving skills, critical thinking\"\n}\n```"]
[{"title": "barista - Store# 66053, 76TH AND MARTIN LUTHER", "company": "Starbucks", "posted_date": "3/7/23", "job_reference": "10762748", "req_number": "4107", "url": "https://www.localjobs.com/job/greendale-wi-barista-store-66053-76th-and-martin-luther-1", "body": "<p>**Join us and inspire with every cup!**</p>\n<p>At Starbucks, it’s all about connection. People are at the heart of who we are, especially the people that are a part of our store team. We connect with each other, our customers and our communities to make a positive impact every day. We believe in working together to make a difference and in celebrating our shared success, which is why we call ourselves Starbucks “partners.” Starbucks is a place of warmth and belonging, where everyone is welcome, and we value the unique experiences that each partner brings to our team!</p>\n<p>As a Starbucks  **barista** , you’ll create the  _Starbucks Experience_  for our customers through excellent service and expertly-crafted products. You’ll be in an energetic store environment where you’ll have the ability to master your food & beverage craft, work alongside friends and meet new people every day. A cup of coffee and smile can go a long way, and we believe our baristas have the power to be the best moment in each customer’s day. True to  _Our Mission & Values_ , working together we can inspire and nurture the human spirit – one person, one cup and one neighborhood at a time.</p>\n<p>**You’d make a great barista if you:**</p>\n<p>+ Consider yourself a “people person,” and enjoy meeting others.</p>\n<p>+ Love working as a team and appreciate the chance to collaborate.</p>\n<p>+ Understand how to create a great customer service experience.</p>\n<p>+ Have a focus on quality and take pride in your work.</p>\n<p>+ Are open to learning new things (especially the latest beverage recipe!)</p>\n<p>+ Are comfortable with responsibilities like cash-handling and store safety.</p>\n<p>+ Can keep cool and calm in a fast-paced, energetic work environment.</p>\n<p>+ Can maintain a clean and organized workspace.</p>\n<p>+ Have excellent communications skills.</p>\n<p>From free coffee to competitive pay, Starbucks is proud to offer a comprehensive compensation and benefits package to our eligible part-time and full-time partners. Benefits include 100% tuition coverage through our  _Starbucks College Achievement Plan_ , health coverage with a variety of plans to choose from, and stock & savings programs like our equity reward program,  _Bean Stock_ . What’s more, Starbucks offers flexible scheduling and opportunities for paid time off. Visit starbucksbenefits.com for details.</p>\n<p>Benefit Information (<a href=\"https://www.starbucksbenefits.com\">https://www.starbucksbenefits.com</a>)</p>\n<p>**Summary of Experience**</p>\n<p>+ No previous experience required</p>\n<p>**Basic Qualifications**</p>\n<p>+ Maintain regular and consistent attendance and punctuality, with or without reasonable accommodation</p>\n<p>+ Available to work flexible hours that may include early mornings, evenings, weekends, nights and/or  holidays</p>\n<p>+ Meet store operating policies and standards, including providing quality beverages and food products, cash handling and store safety and security, with or without reasonable accommodation</p>\n<p>+ Engage with and understand our customers, including discovering and responding to customer needs through clear and pleasant communication</p>\n<p>+ Prepare food and beverages to standard recipes or customized for customers, including recipe changes such as temperature, quantity of ingredients or substituted ingredients</p>\n<p>+ Available to perform many different tasks within the store during each shift</p>\n<p>**Required Knowledge, Skills and Abilities**</p>\n<p>+ Ability to learn quickly</p>\n<p>+ Ability to understand and carry out oral and written instructions and request clarification when needed</p>\n<p>+ Strong interpersonal skills</p>\n<p>+ Ability to work as part of a team</p>\n<p>+ Ability to build relationships</p>\n<p>_All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran._</p>\n<p>_We are committed to creating a diverse and welcoming workplace that includes partners with diverse backgrounds and experiences. We believe that enables us to better meet our mission and values while serving customers throughout our global communities. People of color, women, LGBTQIA+, veterans and persons with disabilities are encouraged to apply._</p>\n<p>_Qualified applicants with criminal histories will be considered for employment in a manner consistent with all federal state and local ordinances. Starbucks Corporation is committed to offering reasonable accommodations to job applicants with disabilities. If you need assistance or an accommodation due to a disability, please contact us at <a href=\"mailto:applicantaccommodation@starbucks.com\">applicantaccommodation@starbucks.com</a>._</p>\n", "city": "Greendale", "state": "Wisconsin", "country": "United States", "location": "Greendale, Wisconsin", "function": "Barista", "logo": "https://www.localjobs.com/sites/default/files/company_logos/starbucks-logo-200w.gif", "jobtype": "Full time", "education": null, "experience": null, "salary": null, "requiredlanguages": null, "requiredskills": null}, "\n\n`{\n    \"education\": null,\n    \"experience\": \"No previous experience required\",\n    \"salary\": null,\n    \"requiredLanguages\": null,\n    \"requiredSkills\": \"people person, collaboration, customer service, quality, food & beverage craft, cash-handling, store safety, communications\"\n}`"]
[{"title": "Director of Revenue Management", "company": "Marriott", "posted_date": "4/14/23", "job_reference": "11135826", "req_number": "3970", "url": "https://www.localjobs.com/job/bridgewater-township-nj-director-revenue-management", "body": "<p>**Job Number**  23068382</p>\n<p>**Job Category**  Revenue Management</p>\n<p>**Location**  Bridgewater Marriott, 700 Commons Way, Bridgewater, New Jersey, United States</p>\n<p>**Schedule**  Full-Time</p>\n<p>**Located Remotely?**  N</p>\n<p>**Relocation?**  N</p>\n<p>**Position Type**  Management</p>\n<p>**JOB SUMMARY**</p>\n<p>Oversees revenue management activities and managers within area of purview. Responsible for balancing the financial objectives of different lodging products to maximize total revenues and profit associated with guest rooms. Position is accountable for pricing, positioning and inventory of all hotels within area of purview. Oversees all processes associated with demand, revenue, inventory, forecasting and opportunity analysis. Develops and recommends sales strategy for pricing of the transient customer, wholesale, and group segments. Identifies new revenue opportunities and effectively communicates sales strategy and pricing to all key stakeholders. Acts as primary contact and maintains productive relationships with all stakeholders, including hotel General Managers, sales leaders, franchisees and owners.</p>\n<p>**CANDIDATE PROFILE**</p>\n<p>**Education and Experience**</p>\n<p>• 2-year degree from an accredited university in Business Administration, Finance and Accounting, Economics, Hotel and Restaurant Management, or related major; 2 years experience in the revenue management, sales and marketing, or related professional area.</p>\n<p>OR</p>\n<p>• 4-year bachelor's degree from an accredited university in Business Administration, Finance and Accounting, Economics, Hotel and Restaurant Management, or related major; no work experience required.</p>\n<p>**CORE WORK ACTIVITIES**</p>\n<p>**Analyzing and Reporting Revenue Management Data**</p>\n<p>• Analyzes information, identifies current and potential problems and proposes solutions.</p>\n<p>• Analyzes period end and other available systems data to identify trends, future need periods and obstacles to achieving goals.</p>\n<p>• Generates updates on transient segment each period and continually analyzes transient booking patterns.</p>\n<p>• Assists with account diagnostics process and validates conclusions.</p>\n<p>• Maintains accurate reservation system information.</p>\n<p>• Checks distribution channels regularly for hotel positioning, information accuracy and competitor positioning.</p>\n<p>• Identifies the underlying principles, reasons, or facts of information by breaking down information or data into separate parts.</p>\n<p>• Generates and provides accurate and timely results in the form of reports, presentations, etc.</p>\n<p>• Observes, receives, and otherwise obtains information from all relevant sources.</p>\n<p>• Submits reports in a timely manner, ensuring delivery deadlines.</p>\n<p>• Analyzes weekly and monthly STAR information to assist in analyzing past strategies; identifies areas needing improvement, identifies competitor set strengths, and develops strategies to best capture available Market Share.</p>\n<p>• Analyze STAR information to assist in development of RevPAR Index forecasts.</p>\n<p>• Generates yearly room revenue budget.</p>\n<p>**Managing Revenue Management Strategy**</p>\n<p>• Provides critical input to property leaders for development of market sales strategy.</p>\n<p>• Provides revenue management functional expertise and leadership to general managers, property leadership teams and market sales leaders.</p>\n<p>• Initiates, implements and evaluates revenue tests.</p>\n<p>• Ensures that sales strategies and rate restrictions are communicated, implemented and modified as market conditions fluctuate.</p>\n<p>• Assists hotels with pricing and provides input on business evaluation recommendations.</p>\n<p>• Assists in creating and verbalizing positioning and long-term strategies for all segments (group, transient, catering) that are in alignment with brand standards and property objectives.</p>\n<p>• Provides recommendations to improve effectiveness of revenue management processes.</p>\n<p>• Ensures property diagnostic processes (PDP) are used to maximize revenue and profits.</p>\n<p>• Ensures hotel strategies conform to brand philosophies and initiatives.</p>\n<p>• Ensures Operation Teams are aware of current strategies and have the information needed to execute them (daily strategies, current day inventory management, and package inclusions).</p>\n<p>**Building Successful Relationships**</p>\n<p>• Communicates brand initiatives, demand and market analysis to hotels/clusters/franchise partners/owners.</p>\n<p>• Communicates market direction to revenue management, sales and hotel leaders.</p>\n<p>• Develops constructive and cooperative working relationships with others, and maintains them over time.</p>\n<p>• Develops and manages internal key stakeholder relationships.</p>\n<p>• Provides targeted and timely communication of results, achievements and challenges to the stakeholders.</p>\n<p>**Additional Responsibilities**</p>\n<p>• Informs and/or updates executives, peers and subordinates on relevant information in a timely manner.</p>\n<p>• Enters, transcribes, records, stores, or maintains information in written or electronic form.</p>\n<p>• Works with other people to gather the information necessary to manage projects, achieve goals, and resolve problems.</p>\n<p>• Demonstrates knowledge of job-relevant issues, products, systems, and processes.</p>\n<p>• Provides information to supervisors, co-workers, and subordinates by telephone, in written form, e-mail, or in person.</p>\n<p>_Marriott International is an equal opportunity employer. We believe in hiring a diverse workforce and sustaining an inclusive, people-first culture. We are committed to non-discrimination on any protected basis, such as disability and veteran status, or any other basis covered under applicable law. Marriott International considers for employment qualified applicants with criminal histories consistent with applicable federal, state and local law._</p>\n<p>Marriott International portfolio of brands includes both JW Marriott and Marriott Hotels.</p>\n<p>**Marriott Hotels** , Marriott International’s flagship brand with more than 500 global locations, is advancing the art of hosting so that our guests can travel brilliantly. As a host with Marriott Hotels, you will help keep this promise by delivering premium choices, sophisticated style, and well-crafted details. With your skills and imagination, together we will innovate and reinvent the future of travel.</p>\n<p>**JW Marriott**  is part of Marriott International's luxury portfolio and consists of more than 80 beautiful properties in gateway cities and distinctive resort locations around the world. JW believes our associates come first. Because if you’re happy, our guests will be happy. It’s as simple as that. Our hotels offer a work experience unlike any other, where you’ll be part of a community and enjoy a true camaraderie with a diverse group of co-workers. JW creates opportunities for training, development, recognition and most importantly, a place where you can really pursue your passions in a luxury environment. Treating guests exceptionally starts with the way we take care of our associates. That’s The JW Treatment™.</p>\n", "city": "Bridgewater Township", "state": "New Jersey", "country": "United States", "location": "Bridgewater Township, New Jersey", "function": "Food Service", "logo": "https://www.localjobs.com/sites/default/files/company_logos/logo_54.jpg", "jobtype": "Full time", "education": null, "experience": null, "salary": null, "requiredlanguages": null, "requiredskills": null}, "\n\n```json\n{\n    \"education\": \"2-year degree from an accredited university in Business Administration, Finance and Accounting, Economics, Hotel and Restaurant Management, or related major; 2 years experience in the revenue management, sales and marketing, or related professional area.\",\n    \"experience\": \"4-year bachelor's degree from an accredited university in Business Administration, Finance and Accounting, Economics, Hotel and Restaurant Management, or related major; no work experience required.\",\n    \"salary\": null,\n    \"requiredLanguages\": null,\n    \"requiredSkills\": \"Analyzing and Reporting Revenue Management Data, Managing Revenue Management Strategy, Building Successful Relationships\"\n}\n```"]
[{"title": "Pharmacy Tech PRN", "company": "AdventHealth", "posted_date": "4/1/23", "job_reference": "11005012", "req_number": "2522", "url": "https://www.localjobs.com/job/davenport-ia-pharmacy-tech-prn", "body": "<p>**Description**</p>\n<p>**All the benefits and perks you need for you and your family:**</p>\n<p>+ Career Development</p>\n<p>+ Whole Person Wellbeing Resources</p>\n<p>+ Mental Health Resources and Support</p>\n<p>**Our promise to you:**</p>\n<p>Joining AdventHealth is about being part of something bigger. It’s about belonging to a community that believes in the wholeness of each person, and serves to uplift others in body, mind and spirit. AdventHealth is a place where you can thrive professionally, and grow spiritually, by Extending the Healing Ministry of Christ. Where you will be valued for who you are and the unique experiences you bring to our purpose-minded team. All while understanding that  **together**  we are even better.</p>\n<p>**Schedule:**   PRN</p>\n<p>**Shift** : As Needed, Variable Shift</p>\n<p>**Location:**  410 South 11th Street, Lake Wales, FL 33853</p>\n<p>**The community you’ll be caring for:**  AdventHealth Lake Wales</p>\n<p>+ AdventHealth Heart of Florida is a licensed 193-bed acute care hospital, coupled with outpatient services including imaging, rehab, lab and wound care, that has been serving the community for over 50 years.</p>\n<p>+ As a part of the AdventHealth network patients will have greater access to a wide range of innovative therapies, new research, leading-edge technology and an extensive team of medical specialists.</p>\n<p>+ High-quality care that has been recognized by the Joint Commission, the American Heart Association and the American Diabetes Association.</p>\n<p>+ Located in Davenport, FL., which is close to major destinations, like Busch Gardens, Legoland, and Walt Disney World, without being located in the central hub of tourism.</p>\n<p>**The role you’ll contribute:**</p>\n<p>Pharmacy Tech I PRN Primary responsibility is the provision of medication distributive functions and pharmacy operational tasks, which includes but is not limited to assisting the pharmacist with all duties of preparing and dispensing of medications, inventory management, and regulatory compliance.  Performs duties necessary for the effective daily operation of all department services and programs.  Accurately responds to medication dispensing requests, prepares medications for pharmacist final review/check, delivers checked medications, and returns unused or expired medications to appropriate pharmacy areas. Actively participates in outstanding customer service and accepts responsibility in maintaining relationships that are equally respectful to all.</p>\n<p>**The value you’ll bring to the team:**</p>\n<p>+ Actively performs all pharmacy technician functions and maintains active proficiency in standard work parameters, hospital and pharmacy specific computer systems, and operational programs</p>\n<p>+ Maintains operational expertise and competency in, and actively provides coverage of technician services provided by central pharmacy operations</p>\n<p>+ Appropriately utilizes medication automation, technology, and computer systems. Maintains expertise in Cerner processes and accurately interprets electronic records</p>\n<p>+ Accurately completes medication inventories and accurately prepares and dispenses patient‐specific medication doses. Prevents improper drug, dose, dosage form selection, expiration dating, and barcode scanning issues when checking products</p>\n<p>+ Understands how to handle process and appropriately dispose of all waste materials, including all levels of hazardous waste, within the department. Knowledgeable about the appropriate use of Personal Protective Equipment (PPE) and Hazardous Medication Spill Kits in the event of a cytotoxic spill</p>\n<p>**Qualifications**</p>\n<p>**The expertise and experiences you’ll need to succeed:**</p>\n<p>+ Must be registered with the State of Florida Board of Pharmacy as a Pharmacy Technician</p>\n<p>This facility is an equal opportunity employer and complies with federal, state and local anti-discrimination laws, regulations and ordinances.</p>\n<p>**Category:**  Pharmacy</p>\n<p>**Organization:**  AdventHealth Heart of Florida</p>\n<p>**Schedule:**  1 - Day</p>\n<p>**Shift:**  AdventHealth Heart of Florida</p>\n<p>**Req ID:**  23010223</p>\n<p>We are an equal opportunity employer and do not tolerate discrimination based on race, color, creed, religion, national origin, sex, marital status, age or disability/handicap with respect to recruitment, selection, placement, promotion, wages, benefits and other terms and conditions of employment.</p>\n", "city": "Davenport", "state": "Iowa", "country": "United States", "location": "Davenport, Iowa", "function": "Healthcare", "logo": "https://www.localjobs.com/sites/default/files/company_logos/adventhealth.jpg", "jobtype": "Full time", "education": null, "experience": null, "salary": null, "requiredlanguages": null, "requiredskills": null}, "\n\n```json\n{\n  \"education\": null,\n  \"experience\": \"Must be registered with the State of Florida Board of Pharmacy as a Pharmacy Technician\",\n  \"salary\": null,\n  \"requiredLanguages\": null,\n  \"requiredSkills\": \"Medication Distributive Functions, Pharmacy Operational Tasks, Assisting the Pharmacist, Preparing and Dispensing of Medications, Inventory Management, Regulatory Compliance, Customer Service, Medication Automation, Technology, Computer Systems, Cerner Processes, Electronic Records, Medication Inventories, Dispose of Waste Materials, Hazardous Waste, Personal Protective Equipment, Hazardous Medication Spill Kits\"\n}\n```"]
[{"title": "RN Manager OR", "company": "Baylor Scott & White Health", "posted_date": "3/27/23", "job_reference": "10953708", "req_number": "2820", "url": "https://www.localjobs.com/job/pflugerville-tx-rn-manager-or", "body": "<p>**JOB SUMMARY**</p>\n<p>The Manager, Nursing Operating Room (OR) Registered Nurse (RN) is accountable for creating and sustaining a healthy work environment for assigned nursing and unit-based personnel which fosters excellent professional nursing practice, mutual conclusion-making, interprofessional synergy and partnership, and a safe and caring environment for patients, family and staff. The manager plans, develops, implements, evaluates and monitors policies and procedures, budgets and the allocation of resources, continuous quality and performance improvement initiatives, educational programs and mutual governance councils to achieve departmental and organizational goals and targets. Provides nursing care as needed.</p>\n<p>**ESSENTIAL FUNCTIONS OF THE ROLE**</p>\n<p>+ Professional Practice Environment: Develops and articulates a vision for nursing practice for area of responsibility. Engages supervisors and staff in the development and implementation of departmental goals and targets. Creates, fosters and sustains a healthy work environment through mutual governance structures and processes which helps evidence-based nursing practice and research. Facilitates the professional development of staff including clinical and leadership expertise, through role modeling, teaching and coaching/mentoring. Ensures that staff members maintain proficiency based on standards of practice for patient population served. Ensures that staff are well-informed by communicating to staff in a timely manner new/revised protocols, policies and procedures, guidelines and standards.</p>\n<p>+ Quality, Evidence-based Practice and Research: Maintains current knowledge in evidence-based clinical and headship practices, nursing research findings, patient care delivery models and work redesign to proactively identify, plan, implement, evaluate and monitor quality/performance improvement initiatives to advance practice and improve patient care. Systematically studies and evaluates the quality and effectiveness of nursing practice based on a variety of indicators including, but not limited to, State and national regulatory bodies and related national benchmarks. Facilitates practice changes through use of evidence-based practices and research findings by nursing heads and staff. Identifies, proposes and conducts clinical research.</p>\n<p>+ Caring Practices/Service Excellence: Creates and sustains a humane, helpful, safe and therapeutic environment for patients, families and staff. Examines patterns and trends from departmental patient care conferences, interprofessional rounds and outcome data, and implements changes to ensure best caring practices and outcomes for patients, families and staff. Champions service excellence initiatives and ensures consistent implementation by staff. Fosters an environment that is helpful of staff's professional and personal growth. Accountable for development and implementation of the department's succession plan.</p>\n<p>+ Response to Diversity: Identifies issues arising from personal differences and develops awareness of these issues in nursing staff, medical staff and other health care providers. Role models, teaches and provides age-specific and developmentally-appropriate patient care in accordance with established guidelines and scope of duty or practice. Identifies and resolves conflicts that affect performance and/or the work environment.</p>\n<p>+ Advocacy and Moral Agency: Advocates on behalf of the nursing staff to represent the concerns of patients, families and staff. Fosters an ethical practice environment for professional practice and patient care based on optimum communication, synergy and coordination of care. Identifies and helps resolve ethical and clinical concerns. Promotes health care at local, state and national levels.</p>\n<p>+ Facilitation of Learning: Monitors the learning needs of staff and patients/families and assists in the design, implementation and evaluation of appropriate, cost-effective educational opportunities to enhance their knowledge and skills. Facilitates the learning for patients and families, nursing staff, other members of the health care team and community.</p>\n<p>+ Partnership: Role models, teaches and mentors professional leadership and accountability for nursing's role within the interprofessional health care team. Heads and participates in departmental, hospital and system-wide programs, committees and special projects to achieve target outcomes. Partners with medical, allied health and administrative staff to ensure provision of safe, quality, attentive health care.</p>\n<p>+ Systems Thinking: Integrates knowledge of organizational mission, goals, and systems into staff and patient strategies Examines and prioritizes different demands, taking effective action to redesign systems to best meet the needs of patient population and staff.</p>\n<p>+ Professionalism: Improves nursing practice and the work environment through participation in mutual governance and the option-making processes, and meaningfully recognizing the contributions of others. Identifies personal goals and seeks opportunities to pursue life-long learning through continuing education, networking with professional colleagues, membership and involvement in professional nursing organizations, self-study, professional reading, certification and seeking advance degrees. Contributes to the professional development of peers, colleagues and others. Achieves national board certification in specialty within two years of promotion/appointment as Nursing Supervisor.</p>\n<p>**KEY SUCCESS FACTORS**</p>\n<p>+ Knowledge and expertise of nursing and patient care standards and procedures.</p>\n<p>+ Knowledge of laws, rules and regulations; standards and guidelines of certifying and accrediting bodies; hospital and department/unit standards, protocols, policies and procedures governing the provision of nursing care applicable to the area of assignment.</p>\n<p>+ Knowledge of medical terminology; values and practices of health promotion, risk reduction, illness and disease prevention and management; medications and drugs, common dosages, their physical and physiological effects, and possible adverse reactions.</p>\n<p>+ Knowledge of medical and professional nursing ethics and patient privacy rights.</p>\n<p>+ Must be able to communicate thoughts clearly; both verbally and in writing.</p>\n<p>+ Ability to provide age-specific, quality, patient-centered care to all patients through the nursing process and standards of nursing practice with consideration and respect for the diversity of human experience and to develop, evaluate, implement and, as necessary, modify a patient care plan to meet the needs of separate patients.</p>\n<p>+ Ability to make operational options around how work gets done - quality and productivity standards, measurable goals for employees and project teams, etc.</p>\n<p>+ Ability to use broader priorities to resolve how best to use resources to meet schedules and goals.</p>\n<p>+ Ability to make or approve effective hiring and termination conclusions.</p>\n<p>+ Ability to evaluate and recommend changes to policies, and establish procedures that affect the managed organization.</p>\n<p>+ General computer skills, including but not limited to: Microsoft Office, information security, scheduling and payroll systems, electronic medical documentation, and email.</p>\n<p>**BENEFITS**</p>\n<p>Our competitive benefits package includes the following</p>\n<p>+ Immediate eligibility for health and welfare benefits</p>\n<p>+ 401(k) savings plan with dollar-for-dollar match up to 5%</p>\n<p>+ Tuition Reimbursement</p>\n<p>+ PTO accrual beginning Day 1</p>\n<p>Note: Benefits may vary based upon position type and/or level</p>\n<p>\\#featuredjob423</p>\n<p>**QUALIFICATIONS**</p>\n<p>- EDUCATION - Bachelor's</p>\n<p>- MAJOR - Nursing</p>\n<p>- EXPERIENCE - 3 Years of Experience</p>\n<p>- CERTIFICATION/LICENSE/REGISTRATION -</p>\n<p>&nbspRegistered Nurse (RN)</p>\n<p>&nbspBasic Life Support (BLS): BLS or BLS within 30 days of hire or transfer.</p>\n<p>As a health care system committed to improving the health of those we serve, we are asking our employees to model the same behaviours that we promote to our patients. As of January 1, 2012, Baylor Scott & White Health no longer hires individuals who use nicotine products. We are an equal opportunity employer committed to ensuring a diverse workforce. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law.</p>\n", "city": "Pflugerville", "state": "Texas", "country": "United States", "location": "Pflugerville, Texas", "function": "Management/Manager", "logo": "https://www.localjobs.com/sites/default/files/company_logos/baylorscott250.jpg", "jobtype": "Full time", "education": null, "experience": null, "salary": null, "requiredlanguages": null, "requiredskills": null}, "\n\n```json\n{\n    \"education\": \"Bachelor's\",\n    \"experience\": \"3 Years of Experience\",\n    \"salary\": null,\n    \"requiredLanguages\": null,\n    \"requiredSkills\": [\n        \"Knowledge and expertise of nursing and patient care standards and procedures\",\n        \"Knowledge of laws, rules and regulations; standards and guidelines of certifying and accrediting bodies; hospital and department/unit standards, protocols, policies and procedures governing the provision of nursing care applicable to the area of assignment\",\n        \"Knowledge of medical terminology\",\n        \"Knowledge of medical and professional nursing ethics and patient privacy rights\",\n        \"Ability to communicate thoughts clearly; both verbally and in writing\",\n        \"Ability to provide age-specific, quality, patient-centered care to all patients through the nursing process and standards of nursing practice with consideration and respect for the diversity of human experience and to develop, evaluate, implement and, as necessary, modify a patient care plan to meet the needs of separate patients\",\n        \"Ability to make operational options around how work gets done - quality and productivity standards, measurable goals for employees and project teams, etc.\",\n        \"Ability to use broader priorities to resolve how best to use resources to meet schedules and goals\",\n        \"Ability to make or approve effective hiring and termination conclusions\",\n        \"Ability to evaluate and recommend changes to policies, and establish procedures that affect the managed organization\",\n        \"General computer skills, including but not limited to: Microsoft Office, information security, scheduling and payroll systems, electronic medical documentation, and email\"\n    ]\n}\n```"]
[{"title": "Bartender", "company": "Buffalo Wings", "posted_date": "3/10/23", "job_reference": "10798640", "req_number": "3036", "url": "https://www.localjobs.com/job/newport-news-va-bartender-1", "body": "<p>In most jobs, everyone doesn’t spontaneously erupt into applause and start raining down high-fives. At Buffalo Wild Wings, that’s just a Thursday night. This is the place to start the next phase of your career. Whether you grow in our system here or your game-plan takes you elsewhere, we want you to have an experience that lasts a lifetime.</p>\n<p>**GAME TIME ENERGY, LIFETIME EXPERIENCE**</p>\n<p>Creating legendary experiences? No problem. As a Bartender, you know what it takes to create a fun and welcoming environment at the bar, serving food in the bar area and preparing flavorful and satisfying beverages for all guests.</p>\n<p>**HOME OF THE GREATEST OF ALL TIMES**</p>\n<p>Buffalo Wild Wings fuels moments worth sharing – for our guests and for our team members. And, when that means access to all these benefits and the game is always on – well, that’s just another day at the office.</p>\n<p>+ Flexible Schedule</p>\n<p>+ Free Shift Meals*</p>\n<p>+ Best in Class Training & Continuous Learning</p>\n<p>+ Advancement Opportunities</p>\n<p>+ Paid Time Off*</p>\n<p>+ 401(k) Retirement Plan*</p>\n<p>+ Tuition Benefits*</p>\n<p>+ Medical, Dental and Vision*</p>\n<p>+ Champions of Hope*</p>\n<p>+ Cash Referral Program</p>\n<p>+ Journey Wellbeing Support Tool</p>\n<p>+ PerkSpot Discount Program</p>\n<p>+ Recognition Program</p>\n<p>+ Slip Resistant Shoes Programs</p>\n<p>+ Community & Charitable Involvement</p>\n<p>+ Igniting Dreams Grant Program</p>\n<p>+ Training Contests</p>\n<p>**YOU GOT THIS**</p>\n<p>+ You are of minimum age to serve alcoholic beverages (or higher, per applicable law).</p>\n<p>+ You know what it takes to fuel moments worth sharing and have exceptional time management, attention to detail, and guest service skills.</p>\n<p>Not sure if your experience aligns? We encourage you to apply. Sports-lover or not, all backgrounds are welcome here.</p>\n<p>Buffalo Wild Wings, Inc. is an equal opportunity employer.</p>\n<p>*Subject to availability and certain eligibility requirements.</p>\n", "city": "Newport News", "state": "Virginia", "country": "United States", "location": "Newport News, Virginia", "function": "Food Service", "logo": "https://www.localjobs.com/sites/default/files/company_logos/buffalologo.jpg", "jobtype": "Full time", "education": null, "experience": null, "salary": null, "requiredlanguages": null, "requiredskills": null}, "\n\n{\n    \"education\": null,\n    \"experience\": \"serving food, preparing beverages\",\n    \"salary\": null,\n    \"requiredLanguages\": null,\n    \"requiredSkills\": \"time management, attention to detail, guest service\",\n}"]
[{"title": "Senior Engineer - Power Electronics - Aviation Research", "company": "General Electric", "posted_date": "3/18/22", "job_reference": "6481670", "req_number": "4466", "url": "https://www.localjobs.com/job/niskayuna-ny-senior-engineer-power-electronics", "body": "<p>**Job Description Summary**</p>\n<p>As a Senior Engineer - Power Electronics, you will be involved in the design of power converters and will work in a collaborative team environment.  You will contribute to the development of advanced power conversion concepts as well as their implementation for application to power generation and transmission, aircraft engine systems, and electric and hybrid vehicle applications.</p>\n<p>Aviation Research will continue to play a vital role in supporting the industry through a historic recovery while shaping the future of flight. We invent the future of flight, lift people up and bring them home safely. Our commitment to lead the industry, to keep safe the flying public and the armed forces, and to lift up one another and our communities, remains our north star. Our purpose is what ties us to one another and gives meaning to our work.</p>\n<p>**Job Description**</p>\n<p>**Essential Responsibilities**</p>\n<p>As part of a multi-disciplinary team, you will contribute to the planning, development, and transition of technologies from concept to products and/or services for GE internal and external clients.</p>\n<p>You will:</p>\n<p>+ Conduct power electronics research through modeling, simulation, design and analysis of power electronic circuits and their controls</p>\n<p>+ Develop and test power converters using wide band gap semiconductor devices and other emerging technologies</p>\n<p>+ Design and test power converter components including Gate drivers, EMI filters, power modules and high frequency transformers</p>\n<p>+ Participate with multi-disciplinary teams in the development of new power technologies and capabilities for GE's next generation product platforms</p>\n<p>+ Innovate in the power electronics space</p>\n<p>+ Effectively communicate results by preparing written reports and making presentations that describe analyses and solutions</p>\n<p>+ Connect the organization to the latest technology developments and trends in industry</p>\n<p>+ Lead proposals for GE businesses as well as government agencies</p>\n<p>+ Contribute to shaping the organizational roadmap</p>\n<p>+ Mentor Engineers in the power electronics domain</p>\n<p>**Qualifications/Requirements**</p>\n<p>+ PhD in Electrical Engineering or a related field with a minimum of 6 years of experience developing power electronics and controls OR a Masters degree in Electrical Engineering or a related field with a minimum of 8 years of experience developing power electronics and controls</p>\n<p>+ U.S. citizenship is required due to Federal Contract Provisions.</p>\n<p>+ Must be willing to work out of an office located in Niskayuna, NY.</p>\n<p>+ Must be 18 years or older.</p>\n<p>+ You must submit your application for employment on the careers page at <a href=\"http://www.gecareers.com\">www.gecareers.com</a> to be considered.</p>\n<p>**Desired Characteristics**</p>\n<p>+ Experience working with hybrid electric aircraft systems</p>\n<p>+ Experience working in an aviation environment</p>\n<p>+ Familiarity with electric vehicles</p>\n<p>_This role is restricted to U.S. persons (i.e., U.S. citizens, permanent residents, and other protected individuals under the Immigration and Naturalization Act, 8 U.S.C. 1324b(a)(3)) due to access to export-controlled technology. GE will require proof of status prior to employment._</p>\n<p>**Additional Information**</p>\n<p>GE offers a great work environment, professional development, challenging careers, and competitive compensation. GE is an Equal Opportunity Employer (<a href=\"https://assets.phenompeople.com/CareerConnectResources/GE11GLOBAL/en\">https://assets.phenompeople.com/CareerConnectResources/GE11GLOBAL/en</a>\\_global/desktop/assets/images/poster\\_screen\\_reader\\_optimized\\_w\\_supplement.pdf)  .  Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law.</p>\n<p>GE will only employ those who are legally authorized to work in the United States for this opening. Any offer of employment is conditioned upon the successful completion of a drug screen (as applicable).</p>\n<p>**Relocation Assistance Provided:**  Yes</p>\n", "city": "Niskayuna", "state": "New York", "country": "United States", "location": "Niskayuna, New York", "function": "Engineering/Architecture", "logo": "https://www.localjobs.com/sites/default/files/company_logos/gelogo.jpg", "jobtype": "Full time", "education": null, "experience": null, "salary": null, "requiredlanguages": null, "requiredskills": null}, "\n\n```json\n{\n  \"education\": \"PhD/Masters in Electrical Engineering or related field\",\n  \"experience\": \"6/8 years of experience developing power electronics and controls\", \n  \"salary\": null,\n  \"requiredLanguages\": null,\n  \"requiredSkills\": \"Modeling, simulation, design and analysis of power electronic circuits and their controls, Gate drivers, EMI filters, power modules and high frequency transformers, Proposals for GE businesses as well as government agencies\"\n}\n```"]
[{"title": "RN Radiology", "company": "Dignity Health", "posted_date": "4/15/23", "job_reference": "11153815", "req_number": "4086", "url": "https://www.localjobs.com/job/bakersfield-ca-rn-radiology", "body": "<p>**RN Radiology**</p>\n<p>Bakersfield Memorial HospitalBakersfield, California</p>\n<p>The posted compensation range of $42.52 - $66.68 /hour is a reasonable estimate that extends from the lowest to the highest pay CommonSpirit in good faith believes it might pay for this particular job, based on the circumstances at the time of posting. CommonSpirit may ultimately pay more or less than the posted range as permitted by law.</p>\n<p>**Requisition ID** 2023-298350 **Employment Type** Full Time **Department** Radiology **Hours/Pay Period** 80 **Shift** Day **Weekly Schedule** Varied Days - Rotating Weekends - Day Shift **Remote** No **Category** Radiology</p>\n<p>**Overview**</p>\n<p>Bakersfield Memorial Hospital includes 385 general acute beds 48 licensed critical care beds 13 state-of-the-art surgical suites and a full-service Emergency Department with an Accredited Chest Pain Center and Nationally Certified Stroke Center. In addition we offer a beautiful Family Care and Birthing Center the Lauren Small Childrens Center including the areas only Pediatric Intensive Care Unit Family Care Center a Level II NICU the Sarvanand Heart and Brain Center with Kern Countys first Bi-Plane Interventional Suite the Center for Wound Care and Hyperbarics and many more services. Memorial Hospital is a Children’s Miracle Network Hospital and is home to the Bakersfield Ronald McDonald House. Memorial Hospital is a member of Dignity Health and is a trusted community partner serving residents of Bakersfield and Kern County with quality compassionate care since 1956. Clickhere (<a href=\"https://www.dignityhealth.org/central-california/locations/memorial-hospital\">https://www.dignityhealth.org/central-california/locations/memorial-hosp...</a>) to learn more about Bakersfield Memorial Hospital.</p>\n<p>**Responsibilities**</p>\n<p>As our Radiology Nurse at Bakersfield Memorial you’ll be expected to perform duties in alignment with the mission and policies of the organization. Performs duties in support of and in compliance with the performance improvement plan JCAHO and other licensing accrediting and regulatory agencies. Is responsible to support the Nurse Manager of the unit to manage and coordinate clinical operations in order to provide quality direct patient care to the pediatric adult and geriatric population. Ensures all aspects of documentation care planning and patient care delivery to meet regulatory requirements. Responsible for fostering a positive interactive team milieu. Facilitates optimal environment to support orientation and competency validation.</p>\n<p>Bakersfield Memorialis a 385 bed non-profit facility providing quality health care to patients and communities in and around Bakersfield CA. We are part of CommonSpirit Health which operates 139 hospitals and more than 1000 care sites across 21 states making our services accessible to nearly 1 in 4 U.S. residents.</p>\n<p>If you are committed to social justice health equity and prepared to deliver care in new innovative ways you belong with us.</p>\n<p>**Qualifications**</p>\n<p>**Minimum Requirements:**</p>\n<p>+ CA RN BLS and ACLS required</p>\n<p>+ PALS certification within 3 months of hire</p>\n<p>+ 1-2 years of previous experience required</p>\n<p>+ Education level necessary to obtain required licensure and certifications</p>\n<p>+ PICC training program within 6 months of hire and maintain competencies</p>\n<p>+ Basic Computer Skills</p>\n<p>**Preferred Skills:**</p>\n<p>+ Acute care experience preferred.</p>\n<p>+ BSN preferred</p>\n<p>**Equal Opportunity**</p>\n<p>CommonSpirit Health™ is an Equal Opportunity/Affirmative Action employer committed to<br />\na diverse and inclusive workforce. All qualified applicants will be considered for<br />\nemployment without regard to race, color, religion, sex, sexual orientation, gender<br />\nidentity, national origin, age, disability, marital status, parental status,<br />\nancestry, veteran status, genetic information, or any other characteristic protected<br />\nby law. For more information about your EEO rights as an applicant,<br />\npleaseclick here. (<a href=\"https://tbcdn.talentbrew.com/company/35300/img/v1\">https://tbcdn.talentbrew.com/company/35300/img/v1</a>\\_0/EEOC\\_KnowYourRightsEnglish.pdf)</p>\n<p>CommonSpirit Health™ will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information. 41 CFR 60-1.35(c).<br />\nExternal hires must pass a post-offer, pre-employment background check/drug screen. Qualified applicants with an arrest and/or conviction will be considered for employment in a manner consistent with federal and state laws, as well as applicable local ordinances, ban the box laws, including but not limited to the San Francisco and Los Angeles Fair Chance Ordinances.<br />\nIf you need a reasonable accommodation for any part of the employment process, please contact us by telephone at (415) 438-5575 and let us know the nature of your request. We will only respond to messages left that involve a request for a reasonable accommodation in the application process. We will accommodate the needs of any qualified candidate who requests a reasonable accommodation under the Americans with Disabilities Act (ADA).<br />\nCommonSpirit Health™ participates in E-Verify.</p>\n<p>Dignity Health is an Equal Opportunity/ Affirmative Action employer committed to a diverse and inclusive workforce. All qualified applicants will be considered for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, marital status, parental status, ancestry, veteran status, genetic information, or any other characteristic protected by law.</p>\n", "city": "Bakersfield", "state": "California", "country": "United States", "location": "Bakersfield, California", "function": "Healthcare", "logo": "https://www.localjobs.com/sites/default/files/company_logos/dignitylogo.jpg", "jobtype": "Full time", "education": null, "experience": null, "salary": null, "requiredlanguages": null, "requiredskills": null}, "\n\n```json\n{\n  \"education\": \"BSN preferred\",\n  \"experience\": \"1-2 years of previous experience required\",\n  \"salary\": \"42.52 - 66.68 /hour\",\n  \"requiredLanguages\": null,\n  \"requiredSkills\": \"PICC training program, BLS, ACLS, PALS certification, Basic Computer Skills\"\n}\n```"]
